<?php

namespace Database\Seeders;

use App\Models\{District, Township, Pagoda};
use Illuminate\Database\Seeder;

class PagodaSeeder extends Seeder
{
    public function run(): void
    {
        // ၁။ Data တွေကို သီးသန့် Array တစ်ခုအနေနဲ့ သိမ်းထားပါ
        $pagodas = $this->getPagodaData();

        foreach ($pagodas as $data) {
            $this->seedPagoda($data);
        }
    }

    // Data တွေကို ဒီ function ထဲမှာပဲ ထည့်ထားပါ
    private function getPagodaData(): array
    {
        return [
            [
        'name' => 'ရွှေမော်ဓောစေတီတော်',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပဲခူး',
        'township_name' => 'ပဲခူး',
        'photo' => 'images/ရွှေမော်ဓောစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3808.556397099817!2d96.49205117132843!3d17.336939667905977!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c3d0d240ebc867%3A0x783d47ae502b939!2z4YCb4YC94YC-4YCx4YCZ4YCx4YCs4YC64YCT4YCx4YCs4YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC64YCZ4YC84YCQ4YC64YCA4YC84YCu4YC4!5e0!3m2!1smy!2smm!4v1702112692783!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'http://bagoshwemawdaw.com.mm/',
        'address' => 'ပဲခူးလမ်း၊ ပဲခူးမြို့',
        'history' => 'ရွှေမော်ဓေါဘုရားကြီ:ကို ပဲခူးမြို့၏အပြင်ဘက် (၆) မိုင်ခန့်အကွာမှစ၍ ထင်ရှားစွာဖူးမြှော်တွေ့ရှိနိုင်သည်။ ဘုရားရှင် သက်တော်ထင်ရှားရှိစဉ်အချိန်တွင် မဟာသာလ၊ စူဠာသာလ ကုန်သည်ညီနောင်(၂) ဦးအား ဆံတော်(၂)ဆူပေးအပ်ခဲ့သည်။ ထိုကုန်သည်ညီနောင်(၂) ဦးတို့သည် ဆံတော်(၂)ဆူအား ပင့်ခဲ့ပြီးနောက် ပဲခူး သုဒဿန တောင်ထိပ်တွင် (၇၅) ပေမြင့်သော စေတီကိုတည်၍ ဆံတော်(၂)ဆူ ဌာပနာခဲ့သည်။ အေဒီ(၈၂၅-၈၄၀) သမလဘုရင် လက်ထက်တွင် စေတီတော်အမြင့်ကို (၈၁) ပေနှင့် ဝိမလဘုရင် လက်ထက်တွင် (၈၈)ပေ အသီးသီးပြန်တည်ခဲ့သည်။\r\n၁၉၁၇ ခုနှစ်တွင် ငလျင်ဒဏ်ကြောင့် ဘုရားကြီး၏ ငှက်ပျောဖူးမှာ မြေခခဲ့ရသည်ကို ဘုရား၏ အရှေ့မြောက်ထောင့် အရပ်တွင် ယနေ့တိုင်တွေ့မြင်ရပါသည်။ ၁၉၂၀ ခုနှစ်မှ စ၍ ယနေ့အထိ ဘုရားကြီးအား ဘက်စုံမွမ်းမံမှုများကိုပြုလုပ်ခဲ့ပါသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'မြသလွန်စေတီတော်',
        'division_name' => 'မကွေးတိုင်းဒေသကြီး',
        'district_name' => 'မကွေး',
        'township_name' => 'မကွေး',
        'photo' => 'images/မြသလွန်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3745.140409342935!2d94.91486767429805!3d20.16987851672504!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30b7d220fcea3621%3A0xf7cf888276d69a8f!2z4YCZ4YCA4YC94YCx4YC4IOGAmeGAvOGAnuGAnOGAveGAlOGAuiDhgIXhgLHhgJDhgK7hgJDhgLHhgKzhgLrhgJnhgLzhgJDhgLrhgIDhgLzhgK7hgLg!5e0!3m2!1smy!2smm!4v1702289305554!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://myathalunpagoda.org',
        'address' => 'ဘုရားလမ်း၊ မကွေးမြို့',
        'history' => 'တိလောကဂ္ဂ ၊ ဘဂျဘဂဝါ ၊ မည်တော်သာသော မြတ်စွာဘုရားသခင်သည် ၊ ဝါတော်နှစ်ဆယ်ကျော် ရောက်လတ်သော် သာဝတ္ထိပြည် ဇေတဝန်ကျောင်းတော်၌ သီတင်းသုံးနေတော်မူသောအခါ သုနာပရန္တတိုင်း လယ်ကိုင်း နာဂရ မြန်ဌာန၌ သုပ္ပာဒက သင်္ဘောဆိပ် ဝါဏိဇ္ဇဂါမ  ရွာသားငါးရာကုန်သော ဥပသကာတို့သည် ကြည်ဖြူ စေတနာ သဒ္ဓါအားထုတ် ဆောက်လုပ်အပ်သော သရက္ခန် စန္ဒကူးဂန္ဓာရုံ တန်ဆောင်းဝန်း ကျောင်းတော်ကို အလှူခံတော်မူ အံ့သောငှာ ဘိုးတော်ဖြစ်သော အဉ္စနမင်းကြီး ဖြိုပြီးသက္ကရာဇ် ၁၂၃ ခုနှစ် နွယ်တာ လဆုတ် (၈) ရက်နေ့တွင် ဝိသကြုံ နတ်သားဖန်ဆင်းထားသည့် ငါးရာသတ်မှတ် ပြာသာဒ်ယာဉ်ပျံ၌ စံနေသော အခြံအရံ ရဟန္တာငါးရာတို့နှင့်တကွ  အဇာဋာလမ်း ကြွချီမြန်းလျက် စန္ဒကူးကျောင်းတော်ကို အလှူခံပြီးလျှင် ခုနစ်ရက်ပတ်လုံး သီတင်းသုံးနေတော်မူပြီး၍ ဝေနေယျကြာ သတ္တဝါအပေါင်းတို့အား  တရားရေအေးအမြိုက်ဆေးကို တိုက်ကျွေးဝေငှ ပါရမီဉာဏ သမ္ဘာရအလိုက် ထိုက်သင့်သော မဂ်ဖိုလ်ဉာဏ်ကို ခံယူပန်ဆင်စေတော်မူပြီးနောက် ထိုကျောင်းမှ တစ်ဖန်ပြန်လည်   မြန်းကြွဒေသစာရီ  ဖြန့်ချီတော်မူခဲ့ရာများစွာ ထိုထိုတောင်ညို ဆားပွက်တို့ဖြင့် ခြံရံအပ်သော ကေလာသဘ နာမြွမက်မြဲ စက္ကိန်းတည်း တောင်ထိပ်သို့ ရောက်တော်မူလေသတည်း။ ထိုစက္ကိန်းတည်းတောင်ထိပ် မြတ်စွာဘုရားသီတင်းသုံးတော်မူရာအရပ်၌ တည်ထားအပ်သော စေတီတော်မြတ်ကို စက္ကိန်းတည်းစေတီဟု ဘွဲ့အမည်သတ်မှတ် ခေါ်ဝေါ်အပ်သတည်း ။',
        'status' => 'famous'
    ],
    [
        'name' => 'ရွှေတိဂုံစေတီတော်',
        'division_name' => 'ရန်ကုန်တိုင်းဒေသကြီး',
        'district_name' => 'ရန်ကုန်',
        'township_name' => 'ဗဟန်း',
        'photo' => 'images/ရွှေတိဂုံစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3808.5565026039108!2d96.49408967493348!3d17.336934583541638!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c3d0d240ebc867%3A0x783d47ae502b939!2sShwemawdaw%20Pagoda!5e0!3m2!1sen!2smm!4v1702542849735!5m2!1sen!2smm" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://shwedagonpagoda.org.mm',
        'address' => 'ပြည်သူ့ရင်ပြင်အနီး၊ ဗဟန်းမြို့နယ်၊ ရန်ကုန်တိုင်း',
        'history' => 'ရွှေတိဂုံ စေတီတော်မှာ ၃၂၆ ပေ မြင့်ပြီး ရန်ကုန်မြို့ရှိ သိင်္ဂုတ္တရ ကုန်းတော်ပေါ်တွင် တည်ရှိသည်။ "လေးဆူဓာတ်ပုံ ရွှေတိဂုံ"ဟုလည်း ခေါ်တွင်သည်။ "စေတီအစ ရွှေတိဂုံက" ဟုဆိုကြသည်။\r\n\r\nရန်ကုန်တိုင်းကို မွန်လူမျိုးတို့သည် ဒဂုံတိုင်းဟု သမုတ်ခဲ့ကြသည်။ ဒဂုံတိုင်းမှာ တည်ထားသော ဘုရားဖြစ်သည့် အတွက်ကြောင့် ဒဂုံတိုင်းကဘုရားဟု ခေါ်ဝေါ်ပြောဆိုခဲ့ကြသည်။ မွန်ဘာသာဖြင့် ကျာ်ဒဂုင် ဟုရေးသားပြီး ကျိုက်ဒဂုံဟုအသံထွက်ဆိုခဲ့ကြသည်။ တတိယမြန်မာနိုင်ငံကို တည်ထောင်ခဲ့သော အလောင်းမင်းတရားကြီးလက်ထက်တွင် မွန်တို့ကို တိုက်ခိုက်အောင်မြင်ပြီးနောက် ဒဂုံကို ရန်ကုန်ဟု အမည်နာမ ပြောင်းလည်ခဲ့သည်။ ကျိုက်လဂုံကို ကျိုက်ဒဂုံ ဟု ခေါ်ဆိုကြသည်။ နောက်ပိုင်းတွင် ကျိုက်လဂုံ(သို့) ကျိုက်ဒဂုံသည် မြန်မာပြည်၏ မူပိုင်သင်္ကေတ အဖြစ်ကျော်ကြားလာခဲ့သည်။ မူပိုင်ကျိုက်ဆိုသော စကားလုံးနေရာတွင် ရွှေနိုင်ငံ (Golden land) ကို ကိုယ်စားပြုသော ရွှေ ဆိုသော စကားလုံးဖြင့် အစားထိုးခဲ့ကြသည်။ ထို့အတူ လဂုံ လိုလို ဒဂုံ လိုလို ဖြစ်နေသောစကားလုံးကိုလည်း တိဂုံ ဖြင့် အတည်ပြုပေးလိုက်ကြသည်။ ထိုအချိန်မှစ၍ ကျိုက်လဂုံ သည် မြန်မာပြည်တွင်မှာ သာမက ကမ္ဘာ့တဝှမ်းမှာ ရွှေတိဂုံ ဟူသော အမည်နာမဖြင့် ခေါ်ဝေါ်ခဲ့ကြသည်။\r\n\r\nကမ္ဘာပေါ်တွင်ဗုဒ္ဓဘာသာ သည် (ခရစ်တော်မပေါ်မီ ဘီစီ(၅၈၈) လွန်ခဲ့သောနှစ်ပေါင်း၂၆၀ဝ ကျော် မဟာသက္ကရာဇ်(၁၀3)ခု ကဆုန်လပြည့် ဗုဒ္ဓဟူးနေ့တွင် စတင် ပွင့်ထွန်း ပေါ်ပေါက်ခဲ့ပါသည်။ မဟာသက္ကရာဇ် (၁၀၃)ခု ဝါဆိုလပြည့် စနေနေ့ ဘီစီ(၅၈၈)မှာ ဓမ္မရတနာ စတင်ခဲ့သည်။ မဟာသက္ကရာဇ် (၁၀၃)ခု ဝါဆိုလပြည့်ကျော် ၂ ရက် တနင်္လာနေ့ ဘီစီ (၅၈၈) တွင် သံဃာရတနာ စတင်ပေါ်ပေါက်ခဲ့ပါသည်။ ဂေါတမဗုဒ္ဓမြတ်စွာဘုရားသည် ကမ္ဘာပေါ်တွင် ဝိပဿနာ ကျင့်စဉ်ကိုဘီစီ (၅၈၈) လွန်ခဲ့သော နှစ်ပေါင်း၂၆၀ဝ-ကျော်တွင်ပထမဆုံးသော စတင်တွေ့ရှိကျင့်ကြံအားထုတ် ခဲ့ သူဖြစ်သည်။ မြတ်ဗုဒ္ဓသည် ဘုရားအဖြစ်နှင့် (၄၅)နှစ်နေပြီး မဟာသက္ကရာဇ် ၁၄၈ ခု ကဆုန်လပြည့် အင်္ဂါနေ့ ဘီစီ ၅၄၃ မှာ ပရိနိဗ္ဗာန် စံလွန်တော်မူသည်။ ဗုဒ္ဓအဖြစ် ၄၅ နှစ်အတွင်း တာဝန်ကြီး ၂ ရပ်ကို တစ်နေ့လျှင် 2၂ နာရီ မိနစ် ၂၀ ခန့်မျှ နေမအား ညမနား လူသား, သတ္တဝါတို့၏ ကောင်းကျိုးကို မျှော်ကိုး၍ ထမ်းဆောင်တော်မူခဲ့သည်။ သဗ္ဗညု မြတ်စွာဘုရားရှင်သည် ဗောဓိပင်ရင်း သတ္တဌာန၌ (၇)ရက်စီ အလှည့်ကျစံတော်မူပြီး (၄၅)ရက် သီတင်းသုံး နေတော်မူ ခဲ့သည်။ ဤသို့ နေတော်မူ (၄)ရက်ပြည့်မြောက်ပြီး နောက် တစ်နေ့၌ "ရာပဒတန်သတ္တဟ" ဖြစ်သည့် လင်းလွန်းပင်ရင်း၌ သီတင်းသုံး စံတော်မူစဉ်ကာလ။ ဗုဒ္ဓဝင် သမိုင်းကို ပြန်ကြည့်လျှင် ဂေါတမဘုရားရှင် လက်ထက်၌ မြန်မာနိုင်ငံ တဖုဿနှင့် ဘလ္လိကမွန်ကုန်သည် ညီနောင်တို့သည် ထူးခြားစွာ ဘုရားရှင်အား ကမ္ဘာပေါ်တွင်ပထမဆုံး ဆွမ်းကပ်ရသူ ကမ္ဘာပေါ်တွင်ပထမဆုံး သရဏဂုံ တည်သူများ နှင့် ကမ္ဘာပေါ်တွင်ပထမဆုံးဗုဒ္ဓဘာသာဝင်များ ဖြစ်ခဲ့၏။\r\n\r\nဘီစီ (၅၈၈)၌ မွန်တို့ဌာနေ၊ ဥက္ကလာပမင်းကြီး၏ နိုင်ငံတော်တွင် ပါဝင်သော အသိဉ္စနမြို့၌ သုဝဏ္ဏအမည်ရှိသော သူဌေးကြီးတစ်ဦးရှိလေသည်။ ထိုသူဌေးကြီးတွင် တဖုဿနှင့် ဘလ္လိက ဟူသော သားနှစ်ယောက်ရှိသည်။ ၎င်းတို့သည် ကုန်သည်များ ဖြစ်ကြသည်။ ၎င်းကုန်သည် ညီနောင်တို့သည် ကုန်များကို သင်္ဘောဖြင့် တင်ဆောင်ကာ မဇ္ဈိမဒေသသို့ ကုန်ရောင်းသွားကြသည်။ မဇ္ဈိမဒေသပင်လယ်ဆိပ်ကမ်းသို့ ရောက်သောအခါ သင်္ဘောကို ဆိုက်ကပ်ကျောက်ချ၍ ကုန်များကို လည်းအစီးပေါင်း (၅၀ဝ)ပေါ်သို့ တင်ဆောင်ကာ မဇ္ဈိမဒေသ၌ လှည့်လည်ရောင်းချကြသည်။ တဖုဿ ဘလ္လိက မွန်ကုန်သည်ညီနောင်အဖွဲ့သည် ဗောဓိပင်အနီးသို့ ရောက်ရှိ လာခဲ့ကြ၏။ ကုန်သည်တို့ မဟာဗောဓိပင် အနီးသို့ရောက်ပြီး တစ်နေ့ သို့မဟုတ် တစ်ည၌ ရုက္ခစိုးနတ်သည် ကုန်သည်ညီနောင်အား ကိုယ်ထင်ပြခဲ့၏။ ကုန်သည်ညီနောင်တို့သည် ရုက္ခစိုးနတ်အား မြင်လျှင် အံ့ဩသွားကြ၏။ အသင်မည်သူနည်း ဟုမေး၏။\r\n\r\nရုက္ခစိုးနတ်က "အမောင်တို့ နားထောင်လော့ ကျွန်ုပ်က တခြားမဟုတ်၊ ကျွန်ုပ်သည် ဟိုးဘဝက အမောင်တို့နှင့် ဆွေမျိုးတော်စပ်ခဲ့သူများ ဖြစ်ပြီး၊ ကျွန်ုပ်သည် ဟိုးရှေးဘဝက ကောင်းမှုကောင်းကျိုးများ ပြုခဲ့သူ ဖြစ်သဖြင့် ယခုဘဝတွင် ရုက္ခစိုးနတ်ဖြစ်ခဲ့သည်။ အမောင်တို့ ယခု သင်တို့ထံသို့ ရောက်ခဲ့သည်မှာ သင်တို့နှင့်ကျွန်ုပ်သည် ယခင် ဘဝဆွေမျိုးတော်စပ်ဖူးသူ ဖြစ်သဖြင့် သင်တို့အား အကျိုးပြုရန် ဤသို့ ကိုယ်ထင်ပြရခြင်းဖြစ်သည် အမောင်တို့" ဟုပြောသည်။ ကုန်သည်ညီနောင်က "အသင်က မည်သို့ အကျိုးပြုဖို့လာသနည်း"ဟု ရုက္ခစိုးနတ်ကို မေး၏။ ထိုအခါ ရုက္ခစိုးနတ်က"နားထောင်လော့ အမောင်တို့ ကျွန်ုပ်သင်တို့အား အကျိုးပြုသည်ဆိုသည်မှာ အခြားမဟုတ်ပါ။ ပြောရလျှင် အမောင်တို့ ရောက်ရှိနေသည့် မဇ္ဈိမဒေသတွင် သုံးလောကထွဋ်ထား ရှင်တော်မြတ်ဘုရားဟာ ပွင့်တော်မူပြီး လင်းလွန်းပင်ခြေရင်းမှာ သီတင်းသုံး စံတော်မူနေတာမို့ အမောင်တို့ သွားရောက် ပူဇော်လော့ တိုက်တွန်းလမ်းညွှန်လိုတယ် အမောင်တို့"ဟုဆိုလျှင် တဖုဿနှင့် ဘလ္လိက ကုန်သည်ညီနောင်တို့ အလွန်တရာ ဝမ်းမြောက်ကြည်နူးသွားကြ၏။ ချက်ချင်းပင် "ဒါဆို ကျွန်ုပ်အား လမ်းညွှန်ပြပါ ရုက္ခစိုးနတ်" ဟုပြော၏။ ထို့နောက် ရုက္ခစိုးနတ်သည် တဖုဿနှင့် ဘလ္လိက ကုန်သည်ညီနောင်တို့အား ဘုရားရှင် သီတင်း သုံးရာ လင်းလွန်းပင်အား လမ်းညွှန်ပြခဲ့၏။ သည်အခါ ကုန်သည် ညီနောင်တို့သည် သဒ္ဓါပီတိအပြည့်နှင့် ဘုရားရှင် သီတင်းသုံးရာ လင်းလွန်းပင်ရင်းသို့ သွားကြ၏။ မြတ်စွာဘုရားရှင်အား မုန့်ကြွပ်ကြော်၊ ပျားမုန့်ထုပ် တို့နှင့် ဘုရားရှင်အား လှူဒါန်းပူဇော်ခြင်းပြု၏။\r\n\r\nကုန်သည်ညီနောင်တို့ မြတ်စွာဘုရားရှင်အား မုန့်ကြွပ် ကြော်၊ ပျားမုန့်ထုပ်တို့နှင့် ပူဇော်သက္ကာကပြု လှူဒါန်းခဲ့သည်။ ဘုရားရှင်မှ ဤသို့ လှူဒါန်းပူဇော်ခဲ့သည့်အတွက် ဗုဒ္ဓံသရဏံ ဂစ္ဆာမိ၊ ဓမ္မံသရဏ ဂစ္ဆာမိ ဟူသည့် "ဒွေဝါစိက" သရဏံဂုံ တည်ခဲ့ကုန်၏။ ထိုစဉ်က ဘုရားရတနာ၊ တရားရတနာ တည်းဟူသည့် ရတနာနှစ်ပါးသည်သာ ပေါ်ထွန်းခဲ့ပြီး၊ သံဃာရတနာသည် ပေါ်ပေါက်ခဲ့ခြင်းမရှိသေးပေ။ ထို့ကြောင့် လူသူအများသည် ရတနာနှစ်ပါးအားသာ ဆည်းကပ်ပူဇော်နေကြကုန်၏။ ဗုဒ္ဓဝင်သမိုင်းကို ပြန်ကြည့်လျှင် ဂေါတမဘုရားရှင် လက်ထက်၌ တဖုဿနှင့် ဘလ္လိက ကုန်သည်ညီနောင်တို့သည် ထူးခြားစွာ ဘုရားရှင်အား ပထမဆုံး ဆွမ်းကပ်ရသူနှင့် ပထမဆုံး သရဏဂုံ တည်သူများ ဖြစ်ခဲ့၏။\r\n\r\nဘုရားရှင်အား ပူဇော်ခွင့်၊ ဆွမ်းကပ်ခွင့်ရခဲ့သည့်အတွက် ပီတိဖြစ်ခဲ့ရသည်။ တဖုဿနှင့် ဘလ္လိက မွန်ကုန်သည်ညီနောင်တို့သည် ဆွမ်းကပ်လှူပူဇော်ပြီးလျှင် "အရှင်ဘုရား၊ တပည့်တော်တို့ အရှင်မြတ်ဘုရားအား ထာဝရကိုးကွယ်ဆည်းကပ်ပူဇော်နိုင်ရန် ဘုရားရှင်ကိုယ်စား ပူဇော်ရာ တစ်ခုအား ပေးသနားတော် မူပါဘုရား" ဟုလျှောက်ထား လေ၏။ "ကောင်းပြီးချစ်သားတို့" မိန့်တော်မူပြီး သကာလ ဦးခေါင်းတော်အား သုံးသပ်ပြီး ဆံတော်မြတ် (၈)ဆူအား ကုန်သည်ညီနောင်တို့ အားပေးသနားတော်မူရာ တဖုဿနှင့် ဘလ္လိက မွန်ကုန်သည် ညီနောင်တို့သည် ဝမ်းမြောက်ပီတိ အပြည့်နှင့် ဗုဒ္ဓဘုရားရှင်၏ ဆံတော်(၈)ဆူအား သင်္ဘောနှင့်ပင့်ဆောင်ကာ ဥက္ကလာပတိုင်းပြည် သို့ ပြန်ခဲ့၏။ တဖုဿနှင့် ဘလ္လိက ကုန်သည်ညီနောင်တို့ ဘုရားရှင်၏ ဆံတော်(၈)ဆူအား ပင့်ဆောင်ကာ ဥက္ကလာပတိုင်းပြည်သို့ ပြန်လာလျှင် ဥက္ကလာပတိုင်း၏ ပြည့်ရှင်မင်းမြတ် ဥက္ကလာပမင်းကြီး နှင့်တကွ ပြည်သူတို့က သောင်းသောင်းဖျဖျကြိုဆိုကာ ဖူးမျှော် ကြည်ညိုကြ၏။\r\n\r\nထို့အတူ ဆံတော်(၄)ဆူအား စေတီတော်အဖြစ် တည်ထား ကိုးကွယ်ရန် ဆုံးဖြတ်ကြ၏။ စေတီတော်အား သိင်္ဂုတ္တရကုန်းတော် ၌ တည်ထားကိုးကွယ်ရန် မင်းနှင့်ပြည်သူတို့က ဆုံးဖြတ်ပြီး သိင်္ဂုတ္တရ ကုန်းတော်သို့ ပင့်ဆောင်ခဲ့၏။ သိင်္ဂုတ္တရကုန်းတော် သို့ရောက်လျှင် ဗုဒ္ဓဘုရားရှင်၏ ဆံတော်(၄)ဆူအား ကြီးကျယ်ခန်းနားသည့် စံကျောင်း၊ မဏ္ဍပ်ကြီး ဆောက်လုပ်၍ပူဇော်ခဲ့သည်။ ယင်းစံကျောင်း မဏ္ဍပ်နေရာ၌ အထိမ်းအမှတ်စေတီတစ်ဆူ တည်ထားခဲ့ကြ၏။ ထိုစေတီသည် နောင်တော်ကြီးစေတီဟု အမည်တွင်၏။\r\n\r\nဥက္ကလာပမင်းကြီးတည်ထားကိုးကွယ်တော်မူသော ရွှေတိဂုံ စေတီတော်ကြီး၌ ဘုရား ၄-ဆူ၏ ဓာတ်တော်မြတ်လေးဆူကို ဌာပနာထားသည်ဟု အဆိုရှိသည်။ ဗုဒ္ဓမြတ်စွာတို့၏ ဆံတော်မြတ်၊ ဓာတ်တော်မြတ်တို့အား ရန်သူတို့ အလွယ်တကူ မဖျက်ဆီးနိုင်ရန်အတွက် နတ်တို့သည် ဌာပနာ တိုက်ထည့်သွင်းတည်ရန် ကြံရွယ်ပြီး သိင်္ဂုတ္တရကုန်းတော် အလယ်တည့်တည့်၌ ဇောက် ၄၀၄တောင်၊ အနံ ၄၄ တောင်ရှိသည့် ဥမင်လိုဏ်ခေါင်းတစ်ခုတူးခဲ့၏။ ထိုဥမင်လိုဏ်ခေါင်းအတွင်း၌ဆူးလေနတ်ကြီးထံမှ ရရှိသော ကကုဿန်မြတ်စွာဘုရားရှင်၏ တောင်ဝှေးတော်ရောဟဏီမည်သော ဗိုလ်တထောင်နတ်ကြီးထံမှ ရရှိသည့် ကောဏာဂမန မြတ်စွာဘုရားရှင်၏ ရေစစ်တော်ဒက္ခိဏ မည်သော သင်္ကန်းကျွန်း ကျိုက္ကဆံ နတ်ကြီးထံမှ ရရှိသည့် ကဿပမြတ်စွာဘုရားရှင်၏ ရေသနုပ်သင်္ကန်းတော်မြတ်တဖုဿနှင့် ဘလ္လိက ညီနောင်တို့ထံမှ ရရှိသော ဂေါတမမြတ်စွာဘုရားရှင်၏ ဆံတော်မြတ်(၄)ဆူအား မဟာသက္ကရာဇ် ၁၀၃-ခုနှစ်၊ တပေါင်း လပြည့်နေ့၌ ကျောက်ဖျာအခင်းအကာများ ပြုလုပ်၍ ဌာပနာတိုက် ထည့်သွင်းတော်မူခဲ့သည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'ကျိုက်ထီးရိုးစေတီတော်',
        'division_name' => 'မွန်ပြည်နယ်',
        'district_name' => 'ကျိုက်ထို',
        'township_name' => 'ကျိုက်ထိုမြို့',
        'photo' => 'images/ကျိုက်ထီးရိုးစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3805.5409397194576!2d97.09570257422853!3d17.481672600083954!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c30a774afb2ae1%3A0xe3bbe018e15e96fa!2z4YCG4YC24YCQ4YCx4YCs4YC64YCb4YC-4YCE4YC64YCA4YC74YCt4YCv4YCA4YC64YCR4YCu4YC44YCb4YCt4YCv4YC44YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC6!5e0!3m2!1smy!2smm!4v1702107153011!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://kyaikhteeyoepagoda.org/',
        'address' => 'ကျိုက်ထိုမြို့အနီး၊ မွန်ပြည်နယ်',
        'history' => 'မြတ်ဗုဒ္ဓသမိုင်းဝင် ဆံတော်ရှင်ကျိုက်ထီးရိုးစေတီတော်မြတ်ကြီးသည် ရသေ့ ဦးခေါင်းနှင့်တူသော ကျောက်လုံးတော်ကြီးပေါ်တွင် စေတီတော်တည်ထားခဲ့ခြင်းဖြစ်သည်။\r\nဆံတော်ရှင်ကျိုက်ထီးရိုးစေတီတော်သည် မွန်ပြည်နယ်၊ ကျိုက်ထိုခရိုင်၊ ကျိုက်ထိုမြို့ နယ်အတွင်းရှိ ပေါင်းလောင်းတောင်ထိပ် အမြင့်ပေ၃၆၁၅တွင် တည်ရှိပြီး၊ ကျိုက်ထိုမြို့မှ (၁၆) မိုင်အကွာတွင်တည်ရှိပါသည်။ \r\n စေတီတော်၏ ဉာဏ်တော်၂၂ပေ၅လက်မရှိပြီး၊ နှမ်းဖတ်ကျောက်အမျိုးအစား ကျောက် လုံးတော်ကြီးပေါ်တွင် တည်ရှိပါသည်။ ကျောက်လုံးတော် ကြီးနှင့် အောက်ခံကျောက်တိုင်ထိပ်တို့ ထိဆက်နေမှုသည် ၇.၆၅စတုရန်းပေသာ ရှိပါသည်။\r\nမဟာသက္ကရာဇ်(၁၁၁)ခုနှစ်တွင် မြတ်စွာဘုရားသခင်သည် မဇ္ဇျိမဒေသ သုဝဏ္ဏဘူမိ (သထုံ) သို့ ကြွရောက်လာစဉ်ကဇွဲကပင်တောင်နေ သီဟရသေ့၊ဇင်းကျိုက်တောင်နေတိဿရသေ့တို့သည် မြတ်စွာဘုရားထံမှ ရရှိထားသည့် ဆံတော်(၂)ဆူကျစီရရှိထားသည့်အနက် သီဟရသေ့ကြီးသည် ဇွဲကပင်နှင့်ဇင်းကျိုက်တောင်တို့၌ စေတီတော်တစ်ဆူစီကို ဆံတော်တစ်ခုစီ ဌာပနာ၍ တည်ထားကိုး ကွယ်ခဲ့ကြသည်။ ကေလာသရသေ့ကြီး စုတေကွယ်လွန်ခဲ့သဖြင့် ရသေ့ကြီး၏ ဆံကျစ်အတွင်းရှိ ဆံတော်တစ်ဆူကို တိဿရသေ့ကြီးက သိမ်းဆည်း၍ ယခင်ဆံတော်(၂)ဆူနှင့် ပေါင်းလျက် ဆံတော်(၃)ဆူ ကို ၎င်း၏ဦးခေါင်းဆံကျစ်ကြားတွင် ထားရှိ ကိုးကွယ်ထားပါသည်။\r\n',
        'status' => 'famous'
    ],
    [
        'name' => 'ဥပ္ပါတသန္တိစေတီတော်',
        'division_name' => 'နေပြည်တော်',
        'district_name' => 'နေပြည်တော်',
        'township_name' => 'ပုဗ္ဗသီရိမြို့နယ်',
        'photo' => 'images/ဥပ္ပါတသန္တိစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3754.6245585854867!2d96.18049927428696!3d19.77109962978541!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c8b96cc1f4e7f1%3A0x1d8ea57a73e33c39!2z4YCl4YCV4YC54YCV4YCr4YCQ4YCe4YCU4YC54YCQ4YCt4YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC6!5e0!3m2!1smy!2smm!4v1702107777149!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://uppatasantipagoda.org.mm',
        'address' => 'ရာဇဌာနီလမ်း၊ ပုဗ္ဗသီရိမြို့နယ်၊နေပြည်တော်',
        'history' => 'ပြည်ထောင်စုမြန်မာနိုင်ငံတော်၊ နိုင်ငံတော်အေးချမ်းသာယာရေးနှင့်ဖွံ့ဖြိုးရေး ကောင်စီဥက္ကဋ္ဌ၊ တပ်မတော်ကာကွယ်ရေးဦးစီးချုပ်၊ ဗိုလ်ချုပ်မှူးကြီးသန်းရွှေ သည် နိုင်ငံတော်  သံဃမဟာနာယကဆရာတော်ကြီးများနှင့်  စစ်ကိုင်းတိုင်း မုံရွာမြို့ ဗောဓိတစ်ထောင် ဆရာတော် အဂ္ဂမဟာသဒ္ဓမ္မဇောတိကဓဇ၊ ဘဒ္ဒန္တနာရဒနှင့် ရန်ကုန်တိုင်း သင်္ကန်းကျွန်းမြို့နယ် ပုညနိမ္မိတာရာမ ရွှေသုဝဏ်ကျောင်းတိုက်ဆရာတော် အဂ္ဂမဟာပဏ္ဍိတ အဂ္ဂမဟာသဒ္ဓမ္မဇောတိကဓဇ ဘဒ္ဒန္တသဒ္ဓိယ မထေရ်မြတ် တို့၏ ဩဝါဒကိုခံယူကာ ရွှေတိဂုံစေတီ တော်မြတ်ကြီး ဉာဏ်တော်ထက် အမြင့်တစ်ပေလျော့၍ ဉာဏ်‌တော် အမြင့် ၃၂၅ ပေဖြင့် ရွှေတိဂုံပုံတူ “ဥပ္ပါတသန္တိစေတီတော်မြတ်ကြီး” ကို တည်ထား ကိုးကွယ်ခဲ့ကြပါသည်။\r\n“ဥပ္ပါတ” ဖြစ်ပေါ်တွေ့ကြုံလာသည့် ဘေးအန္တရာယ် အားလုံးကို “သန္တိ” ငြိမ်းအေးစေခြင်း ဟူသော အနက်အဓိပ္ပာယ်ကို ရယူကာ ဥပ္ပါတသန္တိ စေတီတော် ဟူ၍လည်းကောင်း၊ စေတီတော်တည်ထားသည့် ကုန်းတော်အား “ဥပ္ပါတ သန္တိကုန်းတော်” ဟူ၍လည်းကောင်း ပူဇော်သမုတ်ခဲ့ကြပါ သည်။   ',
        'status' => 'famous'
    ],
    [
        'name' => 'မဟာမြတ်မုနိဘုရား',
        'division_name' => 'မန္တလေးတိုင်းဒေသကြီး',
        'district_name' => 'မန္တလေး',
        'township_name' => 'ချမ်းမြသာစည်မြို့နယ်',
        'photo' => 'images/မဟာမြတ်မုနိဘုရား.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3700.5502586087573!2d96.0759383743501!3d21.951834655437587!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30cb6d4f5ff5e9d5%3A0x9352ca8131e3edf2!2z4YCZ4YCf4YCs4YCZ4YCv4YCU4YCt4YCb4YCv4YCV4YC64YCb4YC-4YCE4YC64YCQ4YCx4YCs4YC64YCZ4YC84YCQ4YC64YCA4YC84YCu4YC4!5e0!3m2!1smy!2smm!4v1702108716585!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://mahamunipagodamandalay.org.mm/',
        'address' => 'ကျွန်းလုံးဥသျှောင်ရပ်ကွက်၊ ချမ်းမြသာစည်မြို့နယ်၊ မန္တလေးမြို့',
        'history' => 'ဗုဒ္ဓမြတ်စွာဘုရား သက်တော်ထင်ရှားရှိစဉ် မဟာသက္ကရာဇ်(၉၇) ခုနှစ်တွင် စန္ဒသူရိယမင်း သည် ဓည၀တီရခိုင်ပြည်တွင် နန်းစံ၍ နန်းစံ(၂၆) နှစ်မြောက်တွင် မြတ်ဗုဒ္ဓအား ပူဇော်ပင့်လျှောက် သည့်အခါ မဟာသက္ကရာဇ် (၁၂၃) ခုနှစ်၊ ကဆုန်လပြည့်၊ ဗုဒ္ဓဟူးနေ့တွင် သုံးလူထွဋ်ထား သဗ္ဗညု မြတ်စွာဘုရားသည် ဓညဝတီသို့ ကြွလာတော်မူပါသည်။ ထိုဘုရင် စန္ဒသူရိယမင်း၏ လျှောက်ထားတောင်းပန်ချက်အရ ဗုဒ္ဓမြတ်ဘုရား ကိုယ်တော်တိုင် ဉာဏ်တော် (၇) တောင်၊ (၂) မိုက်၊ (၂) သစ်ရှိ သွန်းပြုဖန်ဆင်းတော်မူ ခဲ့လေသည်။ အမရပူရမြို့တည် ဘိုးတော်ဗဒုံ မင်းတရားကြီးသည် ရခိုင်ပြည် ဓညဝတီသို့ သားတော် မဟာဉပရာဇာ သီရိမဟာဓမ္မာဘိဓဇ သီဟသူရဘွဲ့ခံ အိမ်ရှေ့မင်းသားနှင့် သားတော်စကုမင်း၊ ကာမမင်းတို့ကို တန်ဆောင်မုန်းလဆန်း (၄)ရက်၊ (၁၆-၁၀-၁၇၈၄) နေ့တွင် စေလွှတ်၍ မဟာမုနိ ရုပ်ပွားတော်မြတ်ကို ပင့်ဆောင်စေပါသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'ရွှေစည်းခုံစေတီတော်',
        'division_name' => 'မန္တလေးတိုင်းဒေသကြီး',
        'district_name' => 'ညောင်ဦး',
        'township_name' => 'ညောင်ဦးမြို့',
        'photo' => 'images/ရွှေစည်းခုံစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3719.920187753491!2d94.89141747432741!3d21.195329282038536!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30b5fab4ae38bc97%3A0xdd03aab2c05044c9!2z4YCb4YC94YC-4YCx4YCF4YCK4YC64YC44YCB4YCv4YC24YCF4YCx4YCQ4YCu!5e0!3m2!1smy!2smm!4v1702109235327!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://shwezigon.org.mm',
        'address' => 'ညောင်ဦးမြို့၊ မန္တလေး',
        'history' => 'ပုဂံမင်းဆက် (၅၅) ဆက်ရှိသည့်အနက် (၄၂) ဆက်မြောက် အနော်ရထာ မင်းတရားကြီးက ရွှေစည်းခုံစေတီတော်ကို ကောဇာသက္ကရာဇ် (၄၂၁) ခုနှစ်၊ တပိုတွဲလဆန်း (၁၀)ရက် (၁၄-၁-၁၀၆၀) နေ့တွင်တည်ထား ကိုးကွယ်ခဲ့ပါသည်။ ပုဂံဒေသတွင် အနော်ရထာ မင်းတရားကြီးက ဘုရား၊ စေတီ (၁၅)ဆူ တည်ထားခဲ့ရာ ရွှေစည်းခုံ စေတီတော်သည် နောက်ဆုံးတည်ထားခဲ့သောစေတီ ဖြစ်သည်။နောင်အနှစ်(၃၀)အကြာတွင် ကျန်စစ်သားမင်းကြီးက မူလစေတီကို ငုံ၍ ထပ်မံတည် ခဲ့ပါသဖြင့် နှစ်ထပ်စေတီဖြစ်ပါသည်။ ',
        'status' => 'famous'
    ],
    [
        'name' => 'ရွှေဆံတော်စေတီတော်(သရေခေတ္တရာမြို့ဟောင်းဇုန်ရှိဒွတ္တပေါင်မင်းကြီးတည်ထားခဲ့သောဘုရား)',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပြည်',
        'township_name' => 'ပြည်',
        'photo' => 'images/ရွှေဆံတော်စေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3776.548503063776!2d95.21862757426169!3d18.818264060015057!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c78351f88db9f9%3A0x476462d86f5f08f9!2z4YCb4YC94YC-4YCx4YCG4YC24YCQ4YCx4YCs4YC64YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC64YCZ4YC84YCQ4YC64YCA4YC84YCu4YC4!5e0!3m2!1smy!2smm!4v1702109893706!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://shwesandawpagoda.org.mm',
        'address' => 'ဗိုလ်ချုပ်လမ်း nudge၊ ဆံတော်ရပ်ကွက်၊ပြည်မြို့',
        'history' => 'သူတော်စင်အပေါင်း ယခု ဖူးတွေ့နေကြရသည့် စေတီတော် မြတ်ကြီးသည် ဘုရားသမိုင်းဝင် စေတီတော်ကြီး တစ်ဆူဖြစ်ပါသည်။ ဂေါတမ ဗုဒ္ဓမြတ်စွာ ဘုရား၏ ဆံတော်မြတ် (၄)ဆူ၊ အခြားမွေတော်၊ ဓာတ်တော် (၈) ဆူ၊ နိသိဒိုင်ဓမ္မခဏ်အခင်းတော်တို့နှင့် နောင်တော်ဘုရား (၃) ဆူ ဖြစ်တော်မူကြသော၊ ကကုသန်-ဂေါဏဂုံ-ကဿဖ ဘုရားရှင်တော်တို့၏ ဒုကုဋ်တော်-အံသကိုဋ် (သင်းပိုင်) တော်၊ ခါးပန်းတော်တို့ ဌာပနာထားခဲ့သည့် ဤသုဒဿနတောင်တော် မြတ်ကြီး၌ပင် ဗျာဒိတ်တော်မြတ်အရ၊ ဌာပနာ၍ မဟာသက္ကရာဇ် (၁၀၃) ခုနှစ်၊ တပေါင်းလဆန်း (၁၃) ရက်နေ့၌ အဇ္ဇိက-ဖလ္လိက ကုန်သည်ညီနောင်တို့နှင့် ဧရာပထနဂါးမင်း၊ သမ္ဘူလဘီလူးမင်း၊ သိကြားနတ်များ စတင်တည်ထားကြရာ ယင်းနှစ်တပေါင်းလပြည့်နေ့တွင် အောင်မြင်စွာ တည်ထားခဲ့ပြီး မူလက ဉာဏ်တော် (၇) တောင်၊ အလျား×အနံ (၁၄) တောင်ဖြင့် စပါးစုပုံသဏ္ဌာန် မြေစိုက် စေတီတော် ဖြစ်ခဲ့ပါသည်။ ',
        'status' => 'famous'
    ],
    [
        'name' => 'သျှစ်သောင်းပုထိုးတော်ကြီး',
        'division_name' => 'ရခိုင်ပြည်နယ်',
        'district_name' => 'မြောက်‌ဦး',
        'township_name' => 'မြောက်‌ဦး',
        'photo' => 'images/သျှစ်သောင်းပုထိုးတော်ကြီး.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d14939.067855864285!2d93.1932556!3d20.5975722!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30b10c1989624ea1%3A0x577ba4ae91ca1ef1!2sShaitthaung%20Phayar!5e0!3m2!1sen!2smm!4v1701972429122!5m2!1sen!2smm" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://shitthoungtemplemrauku.org.mm',
        'address' => 'မြောက်‌ဦးမြို့၊ ရခိုင်ပြည်နယ်',
        'history' => 'ရန်အောင်ဇေယျ (ခေါ်) သျှစ်သောင်းပုထိုးတော်ကြီးသည် မြန်မာနိုင်ငံ တစ်     ဝမ်းလုံးကသာမက ကမ္ဘာထိအောင် ကျော်ကြားသည့် မြောက်ဦးမြို့၏ အဓိကဂုဏ်ဆောင် ပုထိုးတော်ကြီးတစ်ဆူလည်းဖြစ်သည်။ ပုထိုးတော်ကြီးအား တည်ထားကိုးကွယ်ခဲ့သူမှာ ဒုတိယမြောက်ဦးခေတ်ကို စတင်တည်ထောင်ခဲ့သော “သီရိသူရိယ စန္ဒမဟာဓမ္မရာဇာ”ခေါ် ဘုရင်မင်းဗာကြီးဖြစ်သည်။ ပုထိုးတော်ကြီးကို နန်းတော်၏ မြောက်ဘက်မိုင်ဝက်ခန့်အကွာ ဖိုးခေါင်တောင်၏မြောက်ဘက် ပေ(၄၀)ခန့်မြင့်သည့် တောင်ကလပ်ပေါ်တွင် တည်ထားခြင်းဖြစ်သည်။\r\n \r\n\r\n ပုထိုးတော်ကြီးကို အေဒီ (၁၅၃၅)ခု၊ ကောဇာသက္ကရာဇ် (၈၉၇)ခု တန်ဆောင် မုန်းလပြည့် စနေနေ့တွင် သျှင်ငယ် ဆရာဦးမြဝါက ဦးဆောင်ရွက်ပြီး ကြံပဋိ ကျမ်းဂန်နှင့်အညီ ရခိုင်အမျိုးသားတို့အား ထွန်းလင်းစေခြင်းအကျိုးငှာ ကောင်းမွန် သော အတိတ်နိမိတ်တို့ကို ယူဆောင်ပြီး “အပြည်ပြည်ကို သျှင်ငယ်ရစ်ဝန်းဧမှုထမ်း”ဟု ရွက်ဆို \r\nဥဒါန်းကျူးတော်မူပြီး ရွှေပန္နက်သဲတိုင် စိုက်ထူကာ တစ်ရာ့ရှစ်ခန်းသော ဌာပနာတို့ကို စီရင်တော်မူ၍ ကျောက်ညို၊ ကျောက်သားတို့ဖြင့် ဖိနပ်ခင်းတော် မူလေသည်။\r\n  ဘုရင်မင်းဗာကြီးသည် ပုထိုးတော်ကြီးမတည်ဆောက်မီ သက္ကရာဇ် (၈၉၄) \r\nတွင် ဘင်္ဂါ (၁၂)တိုင်းဖြစ်သည့် မောက်သူဇာ၊ ဒက္ကာ၊ ဂါန်ဘီလာ၊ သီလက်၊ ပဋိက္ကရား၊ စစ်တကောင်း၊ ဂေါတပလ္လင်၊ ကံသာ၊ တိလင်္ဂါ၊ ဂင်္ဂါသာရ၊ ဘာရီဆာရ်၊ ရောင်ပုရ် စသည်တို့ကို သိမ်းပိုက်အောင်မြင်တော်မူခြင်းနှင့် ပေါ်တူဂီရေတပ်မတော်ကြီးကို \r\nတိုက်ခိုက်အောင်မြင်တော်မူခြင်း အထိမ်းအမှတ်အဖြစ် တည်ထားကိုးကွယ်ခဲ့သည့် \r\nအတွက် “ရန်အောင်ဇေယျ”ပုထိုးတော်ကြီးဟုလည်း ခေါ်တွင်ခဲ့သည်။\r\n  မင်းဗာကြီးဘုရင်သည် ဤသို့ ဘင်္ဂါ (၁၂)တိုင်းကို စစ်အောင်တော်မူပြီးနောက် ဗုဒ္ဓဂါယာသို့ သွားရောက်ကာ မဟာဗောဓိ၌ ကောင်းမှုကုသိုလ်ပြုခဲ့သည်။ မိစ္ဆာလူမျိုးတို့ ဖျက်ဆီးထားသည့် စေတီပုထိုးတို့မှ မရေတွက်နိုင်အောင်များပြားသော ဓါတ်တော်မွေတော်များနှင့် စောင့်ရှောက်သူကင်းမဲ့နေသော ဗုဒ္ဓ၏သီရိပါဒ ခြေတော်ရာကိုလည်း ပင့်ဆောင်လာခဲ့သည်။ ဤကဲ့သို့ အနောက်မဇ္ဈိမဒေသမှ ပင့်ဆောင်လာသော ဓါတ်တော်မွေတော်အပေါင်း ရှစ်သောင်းလေးထောင်ကို ဌာပနာသွတ်သွင်း တည်ထားကိုးကွယ်ခဲ့ခြင်းဖြင့်လည်းကောင်း၊ ဓမ္မခန္ဓာပေါင်း ရှစ်သောင်းလေးထောင် တို့ကိုရည်စူးပြီး ဌာပနာ၍ တည်ထားကိုးကွယ်သဖြင့် “သျှစ်သောင်းပုထိုးတော်ကြီး” ဟု ခေါ်တွင်ခဲ့ကြောင်း သမိုင်းစာမျက်နှာ အထောက်အထားများအရ သိရှိရသည်။\r\n  ပုထိုးတော်ကြီး၏ အောက်ခံလိုဏ်ထပ်ကျောင်းပေါ်တွင် ပင်မစေတီကြီး တစ်ဆူနှင့် အရံစေတီငယ် (၂၆)ဆူ၊ စုစုပေါင်း (၂၇)ဆူတို့သည် ဓါတ်လုံးစေတီ အဖြစ်ဖြင့် သတ္တဗိဿနက္ခတ် (၂၇)လုံးကို ရည်ရွယ်တည်ထားခဲ့ကြောင်း တွေ့ရသည်။ စေတီ တော်ပုံသဏ္ဍာန်မှာ ခေါင်းလောင်းမှောက်၊ ဝေသာလီခေတ်ကျောက် စတူပါသဏ္ဍာန်ဖြစ်ပြီး ဓါတုဂမ္ဘခေါ်သည့် ဓါတ်တော်တိုက်မှာ ကုဗပုံဖြစ်သည်။\r\n \r\n\r\n ပုထိုးတော်ကြီးကို ကြီးမားသော ကျောက်ညို၊ ကျောက်တုံးကြီးများဖြင့် \r\nဝင်္ဂါဘာသဖွယ် လိုဏ်ဂူတော်(၅)ထပ်ဖြင့် တည်ဆောက်ထားသည်ကို ကြည့်ခြင်း အားဖြင့် ပုထိုးတော်ကြီးသည် ထုထည်ကြီးမားမှု၊ ကုန်းတော်မပြိုကျစေရန် ကျောက်တုံးကြီးများဖြင့် အားဖြည့်တည်ဆောက်ထားမှု၊ လိုဏ်ထပ်များစွာပါဝင်မှုစသည့်လက္ခဏာများကြောင့် အချို့သုတေသီများက ခံတပ်ဟုလွဲမှားစွာဖြင့် ထင်မြင်ယူဆထားကြသည်။ ပုထိုးတော်ကြီးကို ကာရံထားသောအုတ်တံတိုင်းသည် မြောက်ဘက်မှ တောင်ဘက်အထိ ပေ(၁၈၀)ခန့်၊ အရှေ့မှ အနောက်သို့ (၂၂၅)ပေခန့် ရှည်သည်။ ပုထိုးတော်ကြီး၏အလျားမှာ (1၆၀)ပေခန့်၊ အနံ (၁၂၄)ပေခန့်၊ သိမ်တော်၏အလျား(၇၀)ပေခန့်၊ အနံ (၄၆)ပေခန့်ရှိပြီး အောက်ခြေ မဟာရံမှဗဟိုစေတီတော်ကြီး အဖျားထိ (၈၆)ပေခန့် မြင့်မားသည်။\r\n  ဘုရားဂူအတွင်းလမ်းကြောင်းများတွင် တည်ရှိသောနံရံများ၏ အထူမှာ (၆)ပေမှ (၁၅)ပေအထိ ရှိသည်။ ပုထိုးတော်ကြီး၏ အနောက်ဘက်တွင် မြောက်ဦးခေတ် ဘုရင်မင်းမြတ်တို့ ဘိသိက်မခံယူမီ မကိုဋ်တော်ဆောင်း၍ မင်္ဂလာတရားနာယူသော အဆောင်တစ်ခုနှင့် ဥပုသ်ဆောင်တော်တစ်ခုရှိသည်။ ပုထိုးတော်ကြီး၏ တောင်ဘက်၊ မြောက်ဘက်နှင့် အနောက်ဘက် အုတ်တံတိုင်းများပေါ်တွင် အရံစေတီငယ် များစွာရှိ သည်။  တောင်ဘက်မျက်နှာတွင် စေတီရံကြီးတစ်ဆူနှင့်  စေတီရံငယ် (၁၇)ဆူ၊ အနောက်ဘက်၌ စေတီရံငယ် (၁၄)ဆူ၊ စုစုပေါင်း (၃၆)ဆူ ရှိသည်။ စေတီရံငယ် တစ်ဆူနှင့် တစ်ဆူကြားတွင် ကျောက်ပြားတစ်ချပ်စီစိုက်ထူထားပြီး ကျောက်ပြားမျက်နှာပြင် တစ်ဖက်တစ်ချက်စီတွင် နိပါတ်တော်လာဇာတ်ကွက်တချို့ကို ရုပ်လုံး၊ ရုပ်ကြွများဖြင့် ထွင်းထုထားသည်။\r\n \r\n\r\n           တောင်ဘက်မျက်နှာစာ စေတီရံငယ်များကြားရှိ ကျောက်ဆစ်ရုပ်ထုများကို သျှစ်သောင်းဘုရားတည် မော်ကွန်းပေစာဟောင်းတစ်စောင်၌ “အိုလေပြည်သူ၊ အိုလူများတို့ သက္ကရာဇ်ရှစ်ရာ၊ ကိုးဆယ်မှလျှင်၊ စွမ်းအင်းခုနှစ် ဖြစ်သည့်ကောဇာ၊ တည်သည်ရာကား၊ မည်သာတွင်ထ၊ မြတ်ဗုဒ္ဓလျှင် ဖြစ်ထများစွာ နုငါးရာနှင့် နောင်လာရှစ်သောင်း၊ ဘုရား\r\nပေါင်း၏ ရုပ်တုများစွာရှိသည်\r\n \r\n\r\nမြောက်ဘက်မျက်နှာစေတီအရံများကြားရှိ ကျောက်ပြားများမှာ အချို့ကျိုးပဲ့ ပျက်စီးနေသည်။ ကျန်နေသေးသော ကျောက်ချပ်များတွင် ဘီလူးရုပ်၊ နဂါးရုပ်၊ ကြာဖူးကိုင်၍ ရှိခိုးပူဇော်နေသော နတ်ရုပ်များလည်းကောင်း၊  ရခိုင်တို့၏ သမိုင်းဦးခေတ်မှ မင်းသားမာရယုနှင့် ရုစိတာမာလာ တို့တွေ့ကြဟန်၊ ငဆဒ္ဒါန်ဘီလူးကို လှံဖြင့်ထိုးဟန် ရုပ်ထုများကို တွေ့ရသည်။\r\n',
        'status' => 'famous'
    ],
    [
        'name' => 'အာနန္ဒာဘုရား',
        'division_name' => 'မန္တလေးတိုင်းဒေသကြီး',
        'district_name' => 'ပုဂံ',
        'township_name' => 'ပုဂံ',
        'photo' => 'images/အာနန္ဒာဘုရား.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3720.5358394572704!2d94.86497297432665!3d21.170862482884505!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30b5e51c276be127%3A0x392ae5db3a1149b9!2z4YCh4YCs4YCU4YCU4YC54YCS4YCs4YCF4YCx4YCQ4YCu!5e0!3m2!1smy!2smm!4v1702391510339!5m2!1smy!2smm" width="400" height="300" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => 'https://anandapagoda.org.mm',
        'address' => 'မြင်းကပါရွာ၊ ပုဂံ၊ မန္တလေးတိုင်းဒေသကြီး',
        'history' => 'တရံခါသော် ကျန်စစ်သားမင်းတရားက အရှင်မြတ်တို့အား အရှင်မြတ်တို့ သီတင်းသုံးခဲ့ရာ ဂန္ဓမာတောင်ရှိ နန္ဒမူလှိုဏ်ဂူကို တန်ခိုးတောင်ဖြင့် သဏ္ဍာန်တူစွာ ပြု၍ ပြတောင်မူရန် လျှောက်ထား တောင်းပန်သည်။\r\nအရှင်မြတ်တို့ကလည်း တန်ခိုးဖြင့် ပြတောင်မူသော် နန္ဒမူလှိုဏ်ဂူ ၏ တင့်တယ်သော အသရေကို မင်းတရားကြီး အလွန်တရာနှစ်သက်ကြည်ညိုခြင်းဖြစ်သည်။ ထို့ကြောင့် မူလရည်ရွယ်ရင်း ရှိခဲ့သော ဘုရားရှင်လေးဆူ စံပါယ်ရန် နန္ဒမူလှိုဏ်ဂူ သဏ္ဍာန် ကောင်းမှုတော် တစ်ဆူကို တည်ဆောက်၍ ပူဇော်ကိုးကွယ်ရန် အကြံဖြစ်တော် မူသည်။ ရဟန္တာ အရှင်မြတ်တို့အားလည်း ကူညီစောင်မရန် လျှောက်ထားတောင်းပန်သည်။ မထေရ်မြတ် တို့ကလည်း သဘောတူညီ ကြသဖြင့် ကောဇာသက္ကရာဇ် (၄၅၂)ခုနှစ် အတွင်း၌ပင် အာနန္ဒာဘုရားကို စတင်တည်ဆောက်ရန် စီမံလေသည် သည်။ဆိုကြသည်။ ဌာပနာတော်တိုက် အတွင်း၌ သွင်းထားပူဇော်အပ်သော ဓာတ်တော်များ ကား ဂေါတမ ဘုရားရှင်၏ လက်သန်း ဓာတ်တော်လေးဆူ၊ သွားတော်ဓာတ်တော်တဆူ ၊ ပုဆစ်ခုန်ညင်းဓာတ်တော်တဆူ၊ လည်ရိုး တော်တဆူ၊ ဦးခေါင်းဓာတ်တော်တဆူ၊ ပါးစောင် ဓာတ်တော်တဆူ၊ ဆံတော်ဓာတ်တော်တဆူ တို့အပြင် သရီရဓာတ်တော် အစစ်ချည်း ၃၀၀ ကျော်တို့နှင့် သင်းပိုင်တော်လည်း ပါဝင် သည်။\r\n',
        'status' => 'famous'
    ],
    [
        'name' => 'ရွှေဘုံသာမုနိစေတီတော်',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပြည်ခရိုင်',
        'township_name' => 'ပြည်မြို့',
        'photo' => 'images/ရွှေဘုံသာမုနိစေတီတော်.jpg',
        'map_link' => '<iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d60421.26470240297!2d95.12370724863278!3d18.82803180000001!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c783622fb9060d%3A0x1f44a44de102b905!2z4YCb4YC94YC-4YCx4YCY4YCv4YC24YCe4YCs4YCZ4YCv4YCU4YCt4YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC64YCZ4YC84YCQ4YC64YCA4YC84YCu4YC4!5e0!3m2!1smy!2smm!4v1717572319812!5m2!1smy!2smm" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>',
        'website' => '',
        'address' => 'ရွှေဘုံသာအုပ်စု၊ရွှေဘုံသာကျေးရွာ',
        'history' => 'မဟာသက္ကရာဇ် ၉၇ ခုနှစ်တွင် ရက္ခပူရ ဓညဝတီ ရခိုင်ပြည်ကြီးတွင် စန္ဒာသူရိယမင်းကြီး သည် မြတ်စွာဘုရားရှင်ပွင့်တော်မူ ကြောင်းကြားသိသောအခါ ဘုရားရှင်အား ရခိုင်ပြည်သို့ ကြွရောက်ပါရန် အဓိဋ္ဌာန်ပြုပင့်ဆောင်ခဲ့ပါသည်။ \r\nဘုရားရှင်သည် သတ္တဝါများ၏ အကျိုးကိုမြင်သောကြောင့် သက္ကရာဇ် ၁၂၃ ခုနှစ်၊ ကဆုန် လပြည့်နေ့တွင် ရခိုင်ပြည်နယ် ကျောက်တော်တစ်ဖက်ကမ်းရှိ သေလာဂီရိ တောင်ထိပ်သို့ ရဟန္တာ (၅ဝဝ) ခြံရံလျက် ကြွလာတော်မူခဲ့သည်။ \r\nစန္ဒာသူရိယမင်းနှင့်တကွ ပြည်သူ့ပြည်သားများက မြတ်စွာဘုရားသခင်နှင့် ရဟန္တာ (၅ဝဝ) တိုအား အထူးထူး ပူဇော်ကန်တော့ကြပြီး၍ ဘုရားရှင်ပြန်လည်ကြွချီတော်မူမည်ပြုစဉ် စန္ဒာသူရိ ယမင်းက မြတ်စွာဘုရား၏ ကိုယ်ပွားတော်ထားရစ်ပါရန် လျှောက်ထား တောင်းပန်ခဲ့ပါသည်။ မြတ်စွာဘုရားရှင်ကလည်း သာသနာတော် ထွန်းကားစည်ပင်ပြန့်ပွားဖွယ်မြင်သဖြင့် ကိုယ်ပွား တော်ထားရစ်ခဲ့ရန် လိုက်လျောတော်မူခဲ့သည်။\r\nစန္ဒာသူရိယမင်းသည် လူ၊ နတ်၊ ဗြဟ္မာတိုထံမှ စုဆောင်းရရှိသည့် တန်ဖိုး ကိုးကုဋေခန့်ရှိ ရတနာ(၆၅)တင်းအား ကျိုချက်၍ ကိုယ်ပွားတော်သွန်းလုပ်စေခဲ့ပါသည်။ ယင်းသို့ သွန်းလုပ်ခဲ့ သည့် ရုပ်ပွားတော်မှာ မဟာမြတ်မုနိရုပ်ပွားတော်ပင်ဖြစ်ပါသည်။ မဟာမြတ်မုနိဉာဏ်တော်မှာ (၉ပေ ၄လက်မခွဲ) ဖြစ်ပါသည်။\r\nယင်းရုပ်ပွားတော်သွန်းလုပ်ရာမှ ပိုလျှံသည့် ရတနာများဖြင့် ညီတော်ကိုယ်ပွားများ       သွန်းလုပ်စေရာ-\r\n(၁) ရှင်ကျော်မုနိ (ဉာဏ်တော် ၆ပေ၊ ၈ လက်မ)\r\n(၂) ရွှေဘုံသာမုနိ(ဉာဏ်တော် ၅ပေ၊ ၄ လက်မ)\r\n(၃) မာရ်အောင်မြင်မုနိ(ဉာဏ်တော် ၃ပေ၊ ၉လက်မ) ဟူ၍ မုနိသုံးဆူထပ်မံရရှိခဲ့သည်ဟု ဆိုပါသည်။\r\n',
        'status' => 'famous'
    ],

    [
        'name' => 'မဟာစန္ဒာသီဟဘုရားကြီး',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'သာယာဝတီခရိုင်',
        'township_name' => 'ကြို့ပင်ကောက်မြို့',
        'photo' => 'images/မဟာစန္ဒာသီဟဘုရားကြီး.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d7707571.307029744!2d91.24462054086335!3d19.39241059439524!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c7276057e73c5f%3A0x46b4dac0b4f28bab!2zTWFoYSBTYW5kYSBTaWhhIOGAmeGAn-GArOGAheGAlOGAueGAkuGArOGAnuGAruGAn-GAmOGAr-GAm-GArOGAuOGAgOGAvOGAruGAuA!5e0!3m2!1sen!2smm!4v1718799509560!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'သာယာဝတီခရိုင်၊ ကြို့ပင်ကောက်မြို့။',
        'history' => '(ရည်ညွှန်းစာ။ မဟာစန္ဒာသီဟဘုရားကြီး၏ ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်းဖြစ်ပါသည်။)\r\n\r\nမဟာစန္ဒာသီဟ ဘုရားကြီးသည် သမ္ဗောဓိမုနိန်၊ အစိန္တေယျ၊ ဗုဒ္ဓသာသနာ ပွင့်လင်းဖြာသော သာယာဝတီ ဒိစတြိတ်နယ်နိမိတ် အတွင်း သန့်ရှင်းကြည်လင်စည်ဝင်ပြန့်ပြော၊ အံ့ဩစလောံ ကြို့ပင်ကောံဟု၊ ထွန်းတောက်တေဇာ၊ မင်္ဂလာသိဒ္ဓိ ဂုဏ်ထူးရှိသော ပထိရူပ၊ မြို့ဒေသ၌ သီလသမ္မာပညာဝိရိယ၊ ကုလဇာတိ၊ ပရိဘောဂ ဓနသမ္ပတ်ထက်မြတ်စေ တနာသဒ္ဓါပထန္န၊ ကြွယ်ပြည့်ဝသည့်ဘုရားဒါယကာကြီး၊ ဦးအောင်ချင်း ဘုရားအမဒေါ်ဘုံဟူသော မောင်မယ်စုံတို့သည်၊ ခိုလုံနှစ်ခြိုက်ပျော်ပိုက်တည် နေကြလေကုန် သတည်း။ ထိုသို့တည်နေကြရာ ကောဇာသက္ကရာဇ်၊ ၁၂၅၆-ခု တန်ပေါင်းလပြည့်ကျော် ၈ရက်မှာ ဘုရားအမကြီးဒေါ်ဘုံသည် သုံးဆယ့်တစ်ဘုံဥုဿုံမကြွင်း၊ ခပင်းဗိုလ်ခြေများဝေဏေတို့ မသွေမလှန် ငြင်းဆန်နိုင်ရာ၊ ခွင့်မသာသော ဓမ္မတာသင်္ခါရ မရဏသဘောသို့ ရွေ့လျောကွယ်လွန်ရာ ဘုရား ဒါယကာ ဦးအောင်ချင်းသည် ကျန်ကျွင်းသောရုပ်ဟောင်းကို တစ်သောင်းကျော် အသပြာ သဒ္ဓါ ထက်သန် အကုန်ခံ၍ ဘိတ်မာန်လှူဒါန်း ပေးကန်းစွန်ကြဲပြီးလျှင် ချွတ်လွဲဖေါက်ပြား မှောက်မှား ဂတိမကပ်ငြိရအောင် ပတ္တိဒါန ပေးဝေငှလျှက် ဈာပနပြုလိုက်လေကုန်၏။ ထိုသို့ဈာပနာပြုပြီးမှလျှင် ဘုရားဒါယကာကြီး ဦးအောင်ချင်းသည် နှလုံးသွင်းအကြံ ဖြစ်ပြန်သည်မှာ စဉ်လာမခြားဘိုးဘွားဖမိ ဉာတိစသည် အတည်တည်တို့ ကြံစည်အားထုတ် ကျိုးကုတ်ဖွေရှာ၍ရကြသော ဘောဂဥစ္စာ ရတနာ တို့သည် ခန္ဓာပျက်ကြွေစုတေလေက ဤဘဝတွင်သာ ကြွင်းကျန်ရစ်ခဲ့ကြရကုန်၏။ ဓိဌမြင်သိ ဉာဏ်ရှိသသူ ငါထမူတ်းရှည်လျားသံသရာ ခန္ဓာဆက်ဆက်ဖိုလ်မဂ်နိဗ္ဗာန်စံသည် တိုင်အောင်ယူ ဆောင်၍ သွားတော့အံ့ဟု သဗ္ဗညု ကိုယ်စားရုပ်ပွား နိမ္မိတဥဒ္ဒိသာစေတီတော်ကို ထိုရော နာတေ ကာလများ မြောင်ငါးထောင်သာသနာ သဒ္ဒါတရားပြန့်ပွားလေရာ ကြင်နာမြတ်နိုး အားကိုးယုံကြည် ဆောက်တည်သစ္စာ သိက္ခာမယွင်း ညီရင်းတမျှ ချစ်ခင်လှသား ဘုရားအမကြီးဒေါ်ဘုံ၏ အထွေး ဆုံးမောင်ရင်း သီတင်းသီလ အာစာရနှင့်  ဒါနဉုဿုံ လုံးစုံပညာ  လိမ်မာယဉ်ကျေး ဦးရွှေထွေးအမည် ရှိသူ ဉပသကာကြီးအား ကိုယ်စားလွှဲအပ်လျက် အထက်မြို့ဒေသ အမရပူရ တံပဝတီ နေပြည် တော်ြကီးသို့ ခရီးရောက်ဆန့်တက်စေ၍ လက်နီသျီး ပန်းတဉ်းပညာ ကျွမ်းလိမ္မာသော ဆရာ အပေါင်းတို့တွင် ကောင်းနိုးရာရာရွေးကောက်လျှက် အောက်စမွခဏ်မှ သဏ္ဍာန်တော်ပိုင်းခြား၍ ခါးတော်တွင်တချက် အထက်ရင်တော်မှသည် ရွှေစင်လျှော်စင်းကဲ့သို့ လည်ပင်းတော်တိုင် တဠါန နှစ်စနှစ်ပိုင်းဝန်းပိုင်းညီမျှ လှပသပ္ပါယ် ကြည်ညိုဖွယ်အစုံ နိတုံကဥ္စနာရကာ သွေးကြေးမှန် ကြေး တောင်းတို့ကို ဖိုပေါင်းလေးဆယ်တို့ဖြင့် နုနယ်ပျော့ပြောင်းစေလျှက် သွန်းလောင်းပုံထုတ်ရာ ကောဇာသက္ကရာဇ်-၁၂၅၈-ခု သတင်းကျွတ်လပြည့်ကျော် -၃ရက်နေ့တွင် ချောမြေ့သန့်စင် အောင်မြင် ပြီးမြောက်ခြင်းသို့ ရောက်လေကုန်၏။ ယင်းသို့ပြီးမြောက်အောင်ရာ အပြစ်အနာကင်းကွာသန့်ရှင်း ရွှေအဆင်းကဲ့သို့ တဝင်းဝင်းတောက်လျှံသော သဏ္ဍာန်တော်-၅ရပ်ကို မစပ်မဆက်သေးဘဲ ရထားတွဲ ဖြင့် ချီနွှဲ့ပင့်တင်လျှက် ပြည်ခွင်အမရ တမ္ပဝတီဌာနီမြို့ဟောင်းမှ ရွှေ့ပြောင်းဆောင်ယူခဲ့ရာ ဒါယကာရင်းဦးအောင်ချင်း၏ ပျော်ခင်ဌာန ကြို့ပင်ကောက်ဒေသသို့ မြန်းကြွရောက်ရှိကာ သုမ္မိနတ် သန် မြေကြံ့ညီမျှသော ပလ္လင်တည်ရာတွင် ငါးဖြာသောပုံတော်တို့ကို ကိန်းဝတ်တည်ထားတော် မူ လေကုန်၏။ ဤသို့ တင့်တယ်စံပယ်တော်မူပြီးနောက် ကြို့ပင်ကောက်မြို့အရပ်၌ ထပ်၍ တစ်ဖန် ကြွင်းကျန်ကုန်စင် မစုံလင်သေးသော မဏိဓါတ်ဥုက္ခောင်းမြတ်နှင့်တကွ ချလက်ပိုက်လက် အဆက် ၃မြွာကြန်အင်္ဂါတို့ကို ကလျာဏမိတ္တသဟာယ သူတော်ကောင်းအပေါင်း များစွာဉာတကာတို့က လည်း သဒ္ဒါကြည်ညိုကုသိုလ်ကံထူးအလှူ ပါဝင်ကြပြီးလျှင် ယ္ခင်ပထမအမရ မြို့ဟောင်းတွင် သွန်းလောင်းပုံခင်းသော ပန်းတဉ်းဆရာတို့ကိုခေါ်ငင်လာရောက်ကြစေ၍ ခြွေရံပရိဿာတ် ရပ်ဆယ် မျက်နှာ လူရောနတ်ပါ သောသောဆူလျံ ခြိမ့်ခြိမ့်ညံ မျှ ဝန်းရံခလျှက် ကနဦးကသော်မှော် လျော်နရနီ သင်္ဂီရွှေသားအပြားအခဲမှည့်ရွဲရွဲတို့ကို လုံထဲသို့လောင်းကြသဖြင့် ဥုက္ခေါင်းမြတ်ရတနာ၏ မျက်နှာ တော်အပြင်တွင် ရွှေစင်ပကတိ အပြည့်အနက်ဖြစ်စေလျှက် ဆက်လက်ပုံထုတ်၍ သွန်းလုပ်ပြန်ရာ ကောဇာသက္ကရာဇ် -၁၂၅၈-ခု-နှောင်းတခူးလ္ဆန်း-၅ရက်တွင် လစန္ဒာသည် ရန်မြူလွှာကင်းသကဲ့သို့ သန့်ရှင်းကြည်လင်စွာ အောင်မြင်ပြီးစီးခြင်းသို့ရောက်ပြန်လေကုန်၏။ ယင်းသို့ ဉုဿုံလုံးစုံ ကုန်စင် အောင်မြင်ကြသဖြင့် ငါးဌာနသဏ္ဍာန်တော်တို့ကို လျှော်လျော်ရာ အင်္ဂါလှပ ကျနမှန်အောင် အထန် ထန်ဆက်စပ်ကြပါသော်လည်း ပန်းတဉ်းဆရာများစွာ အပေါင်းတို့သည် ကောင်းစွာမစွမ်းနိုင်ကြ ကုန်၏။ ထို့ကြောင့် ထွက်ပယ်မဆက်သွယ်ဘဲ မျက်ကွယ်ပြုကြလေကုန်၏။ ထိုသို့တဖန် လူသာမန်တို့ ကြံစည်ခြင်းငှာ ခဲယဉ်းစွာသော အင်္ဂါတော်ငါးရပ်ကို ဆက်စပ်ခြင်းကိစ္စမှာ ငါမှတပါး မည်သူအားမျှ တင်စားဘို့အနေ မမြင်ချေတကားဟု ယောကျ်ားတို့လုလ္လတို့ဖြင့် ဉုဿဟပြုပြီးလျှင် ယခင်အမည် ပါဒါယကာ ဦးရွှေထွေးသည် နှောင့်နှေးခြင်းမရှိဘဲ မိမိ၏ ဉာဏ်စွမ်းဖြင့် ထောက်လှမ်းတိုင်းထွာ၍ အင်္ဂါတော်ငါးပါးကို တသားတည်းပေါင်းစပ်ရာ အောက်ဓမ္မစဏ်မှသည် ရောင်လျှံတော်အထိ ဉာဏ် တော်ရှိ ၁၂တောင်ကို မိုးမှာဃတမန် ဝိသုကန်နတ်မင်းသည် ဖန်ဆင်း၍ ပြုသသကဲ့သို့ လူ့လောက တကြောဝယ် အံ့ဩ၍ မကုန်နိုင်အောင် ဖြစ်လေကုန်၏။ ယင်းသို့ ကောင်းမြတ်ပေါင်းစပ် ဆက်သွယ် တင့်တယ်ပြုပြင်၍ အောင်မြင်တော်မူခြင်းငှာ ကောဇာသက္ကရာဇ် -၁၂၅၉ခု ဝါခေါင်လဆန်း ၁၅ရက် တွင် ရဲမက်ဖိုလ်ပါ သေနင်္ဂါနှင့် ဒေဝါမာန်မင်း ရံခပင်းကို ပယ်ခွင်းဖြိုဖျက်သည်။ ဖိုလ်မဂ်၏ သ္ခင် အသွင်ရုပ် ဗတ္တိံသလက္ခဏာ အင်္ဂါပြည့်စုံနိတုံရွှေစင် ပလ္လင်ဘူမိ အပ္ပရာဇိတွင် တုမရှိသပ္ပါယ်၍ ထက်ဝက်တော်သဏ္ဍာန်ဖြင့် စံနေတော်မူလေကုန်သတည်း။ ယင်းသို့ဆိုတိုင်း သမိုင်းအလာဒါယကာ ဦးအောင်ချင်း၏ နှစ်လုံးသွင်းဆန္ဒမှာ မစ္ဆေယမဖတ် မငဲ့ကွက်မတွန့်တိုဘဲ ကြည်ညိုခြင်းပြင်းလက်ရာ ကား ကြေးသားပိဿာချိန် ၇ထောင်ကျော် ထုတ်ဖော်စေဟု စုစုတွက်ဆကုန်ကြသည့်ငွေသား ဒင်္ဂါးရေ ၂သောင်းကျော်နှင့် တောင်ကုန်းတော်မြင်ရသော အခန့်သင့်မြေကြင်းကို ငွေစာရင်းအမှတ်မထားဘဲ ရက်များလရှည် အတည်တည်စွန့်ကြဲလျှက် ရဲဝန့်သည့်ဝသန္န အနန္တစေတနာနှင့် မဟာစန္ဒာသီဟဘွဲ့ရ ထင်ရှား ဉဒ္ဒိဿရုပ်ပွားတော်ကို နောက်သားနောင်လာဝိလာ သူတော်စွာတို့သည် သာသနာငါးထောင် များမြောင်ရှည်လျှား ညွှတ်တွားပူဇော် ဖူးမျှော်ရစ်ကြစေရန် ရည်ညွှန်းပြဌာန်းလျှက် လှူဒါန်းခဲ့ပါကုန် သတည်း။ လှူဒါန်းကြည်ဖြူကုသိုလ်မူကား ကိုယ်တူထပ်မျှ ပေးဝေငှ၏ ပုညစုစု ဤကောင်းမှုတို့ နတ်လူသာဓုခေါ်စေသော်….',
        'status' => 'famous'
    ],
    [
        'name' => 'မိုဃ်းကောင်းကျောက်တော်ကြီးဘုရား',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'နတ်တလင်းခရိုင်',
        'township_name' => 'သဲကုန်းမြို့နယ်',
        'photo' => 'images/မိုးကောင်းကျောက်တော်ကြီးဘုရားပုံ.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d484756.8228857164!2d95.31568368740552!3d18.339861358222656!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c722746ec431cd%3A0x8ce93df7480b1f56!2sMya%20Thein%20Tan%20Pagoda!5e0!3m2!1sen!2smm!4v1718796116606!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'ပဲခူးတိုင်းဒေသကြီး(အနောက်ပိုင်း)၊ နတ်တလင်းခရိုင်၊ သဲကုန်းမြို့နယ်၊ ရွာမအုပ်စု',
        'history' => '(ရည်ညွှန်းစာ။ မိုဃ်းကောင်းကျောက်တော်ကြီးဘုရား၏ ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်းဖြစ်ပါသည်။)\r\n\r\nမြန်မာကောဇာ ၁၂၇၂ခုနှစ်၊ မန္တလေးမြို့မှ သုံးရာသုံးဆယ့်လေးမိုင်ကွာဝေးသော မတ္တရာမြို့ စကျင်တောင်မှ စတင်ပင့်ဆောင်ခဲ့ပါသည်။ ကျောက်တုံး၏ ပမာဏမှာ အလျား (၁၀)တောင်၊ အနံ (၇)တောင်၊ အမြင့် (၄)တောင်ရှိသော စကျင်ကျောက်တုံးကြီးကို မန္တလေးမြို့မှ ရန်ကုန်မြို့သို့ မီးရထားဖြင့် ပင့်ဆောင်ပြီး ရန်ကုန်မြို့မှ သဲကုန်းမြို့ဘူတာသို့ တစ်ဆင့်ပင့်ဆောင်ခဲ့၍ ထိုမှတစ်ဖန် သဲကုန်းမြို့တောင်ဘက် BOC လမ်းခွဲမှာ ခေတ္တကိန်းဝပ်ပြီး သဲကုန်း၊ ပုတီးကုန်း၊ ဆင်မြီးဆွဲ လူထုစွမ်းအား ပညာအများဖြင့် တရွေ့ရွေ့ပင့်ဆောင်ခဲ့ရာ ရွာမကျောင်းတိုက်သို့ ရောက်ရှိပြီး မန္တလေးမြို့ ပန်းပုဆရာ ဦးညီသန်းနှင့် တပည့်များစွာ ဝိုင်းကာပုံဖော် ၁၂၇၄ ခုနှစ်၊ ကဆုန်လဆန်း (၁၄)ရက်၊ ခရစ်နှစ် ၁၉၁၂ခုနှစ်၊ ဧပြီလ (၂၉)ရက် တနင်္လာနေ့တွင် ပြီးစီးပြီး စကျင်ကျောက်ဖြင့် ထုလုပ်ထားသော မိုဃ်းကောင်းကျောက်တော်ကြီး ဘုရား၏ ဉာဏ်တော်မှာ ခုနှစ်တောင်နှင့်တစ်မိုက်ရှိပါသည်။ ဂန္ဓကုဋီတိုက်ကျောင်းတော်ကြီးကို သဲကုန်းမြို့ ဦးရွှေရောင်၊ဒေါ်မမနှင့် သား ဦးညွန့်ဟန်၊ဒေါ်ကြည်သန်း မိသားစုတို့က နှစ်လိုအားရ လှူဒါန်းကြပါသည်။ ယခင်စိုက်ပျိုးထားသော ပန်းမျိုးစုံအနက်မှ ယခုအချိန်တွင် ကံ့ကော်ပင်ကြီး နှစ်ပင်နှင့် ခရေပင်ကြီး တစ်ပင်သာ ကျန်ရှိပါတော့သည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'ရွှေဘုန်းပွင့်စေတီတော်ကြီး',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပြည်ခရိုင်',
        'township_name' => 'ပြည်မြို့နယ်',
        'photo' => 'images/ရွှေဘုန်းပွင့်.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3776.3575423610396!2d95.21495987516083!3d18.826763659749695!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c7835777b1d1fd%3A0x1ec80bd227995820!2sShwe%20Phone%20Pwint%20Pagoda%20Street%2C%20Pye!5e0!3m2!1sen!2smm!4v1718426146722!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'အမှတ်(၂၅၀)၊ ဗိုလ်ချုပ်လမ်း၊ ပြည်မြို့။',
        'history' => '(ရည်ညွှန်းစာ : ရွှေဘုန်းပွင့်စေတီတော်မြတ်ကြီး ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော အတ္ထုပ္ပတ္တိသမိုင်းစာအုပ်မှ ကူးယူဖော်ပြထားပါသည်။)\r\n\r\nတည်နေရာ၊ ပြည်မြို့၊ ဈေးကြီးအရှေ့ဘက်ကျောင်းကြီးအိုးတန်းရပ်ကွက်တွင် တည်ရှိသည်။ အရှေ့ဘက်လားသော် လမ်းမတော်လမ်း၊ တောင်ဘက်လားသော် ရွှေဘုန်းပွင့်ဘုရားလမ်း၊ အနောက်ဘက်လားသော် ပန်းတိမ်တန်းလမ်းနှင့်ဈေးကြီး၊ မြောက်ဘက်လားသော် လက်သမားလမ်းတို့အတွင်း တည်ရှိပြီး ဦးပိုင် အမှတ် ၁၁၄၊ ဧရိယာဧကမှာ (၁.၂၀၉)ဧကရှိ သာသနာ့မြေပေါ်တွင် တည်ရှိသည်။ ဘုရားဒါယကာ၊ ဒါယိကာမများ သာသနာတော်နှစ် (၁၂၆)၊ BC-၄၁၈ ခုနှစ်တွင် ဒွတ္တဘောင်မင်းကြီးသည် ရွှေဆံတော်စေတီတော်ကြီးကို ဒုတိယမြောက် ဒါယကာအဖြစ် တည်ထားကိုးကွယ်ပြီးနောက် ၁။ ဒွတ္တဘောင်မင်းကြီး၏ မြောက်နန်းမတော်မိဖုရားကြီး ဥမ္မာရဒေဝီသည် ရွှေဘုန်းပွင့် စေတီတော်မြတ်ကြီးကို ပထမဆုံး ဒါယိကာမကြီး အဖြစ် တည်ထားကိုးကွယ်သည်။ ထိုအချိန်က စေတီတော် မြတ်ကြီးဘွဲ့တော်မှာ အတွင်းရွှေကူဖြစ်သည်။ ဒွတ္တဘောင်မင်းကြီး၏ ယောက်ဖတော် ဥမ္မာရဒေဝီ၏ မောင်တော် နန္ဒသူရိယမင်းသား (ပြည်မင်း)၏ နည်းဦးတွင် တည်ထားသဖြင့် နန်းဦးစေတီ+ အတွင်းရွှေကူဟုလည်း ဘွဲ့တော်တွင်ခဲ့သည်။ ၂။ပြည်မင်းသီဟသူ (သတိုးသီဟဓမ္မရာဇာ)က သာသနာတော်နှစ် (၇၀၇)၊ ခရစ်သက္ကရာဇ်-၁၅၈-ခုနှစ်တွင် ဒုတိယမြောက်ဘုရားဒါယကာအဖြစ် ပြုပြင်တည်ဆောက်မွမ်းမံခဲ့သည်။၃။ မြန်မာ သက္ကရာဇ်-၁၁၈၁ခု၊ ခရစ်သက္ကရာဇ်-၁၈၁၉ခုနှစ်တွင် ကုန်းဘောင်မင်းဆက် ဘကြီး တော်မင်းက တတိယ မြောက်ဘုရားဒါယကာအဖြစ် ပြုပြင်တည်ဆောက်ခဲ့သည်။ စေတီ မြတ်ကြီးဘွဲ့တော်ကိုလည်း ရွှေဘုန်းမြင့် ၊ ရွှေဘုန်းပွင့်ဟူ၍ ဘွဲ့တော်သစ်တင် လှူခဲ့သည်။၄။ အင်္ဂလိပ်-မြန်မာ ဒုတိယ စစ်ပွဲ၊ခရစ်နှစ် ၁၈၅၂-ခုနှစ်တွင် စစ်ပွဲကြောင့်မရှုမလှအတုံးအရုံး ပြိုကွဲပျက်စီးခဲ့သည်။ အင်္ဂလိပ်လက်အောက် ရဟန်းရှင် ပြည်သူများက ရွှေဘုန်းမြင့်၊ရွှေဘုန်းပွင့် စေတီတော် မြတ်ကြီးကို မြန်မာသက္ကရာဇ် ၁၂၆၀-ပြည့်နှစ်၊ ခရစ်သက္ကရာဇ်-၁၈၉၉ခုနှစ်တွင် ပြည်မြို့၊ပြည်သူများ ဒါယကာပြုကာပြည်သူ့ဘုရားအဖြစ် အသစ်တဖန် တည်ထား ကိုးကွယ်ခဲ့ကြသည်။၅။ မြန်မာသက္ကရာဇ် ၁၃၀၇-ခု၊ခရစ်နှစ်-၁၉၄၆ ခုနှစ်တွင် ဒုတိယကမ္ဘာစစ်ဘေးဒဏ်ကြောင့် မီးလောင်ပျက်စီးမှုတို့ကို မူရင်းအတိုင်း ပြန်လည် ပြုပြင်တည်ဆောက်မွမ်းမံခဲ့သည်။ စေတီတော်ကြီးကိုယ်လုံးပြည့် ရွှေသင်္ကန်း ကပ်လှူခြင်းကို ဆယ်နှစ်တစ်ကြိမ် ပုံမှန်ကပ်လှူကြသည်။ ၁၉၉၁-ခုနှစ်၊မှတ်တမ်းအရ ထီးတော်သည် ဘုံ(၉)ဆင့်ရှိပြီး ငှက်မြတ်နားတော်မှာ ဘုရားရင်ပြင်တော်အထိ စေတီတော်၏ ဉာဏ်တော်အမြင့်မှာ (၅၄ တောင့်တစ်ထွာ) (၈ပေ)(၉လက်မ)ရှိပါသည်။ ထောင့်(၈)ထောင့် တွင် (၃ပေ)၊အမြင့်စေတီရံ(၈)ဆူရှိပါသည်။ စေတီတော်ကြီးရဲ့အမြင့်မှာ ခေါင်းလောင်းပုံ အောက်နှုတ်ခမ်းမှ ငှက်ပျော်ဖူး၊ ပိန္နဲတိုင်အထိ၊ (၅၄ပေ)(၁၀လက်မ)သို့မဟုတ်(၃၅)တောင် တစ်ထွာနှင့် (၇)လက်မ ရှိပါသည်။ သပိတ်မှောက်ခါးပတ်လုံးပတ်တော်မှာ (၆၅ပေ)(၇လက်မ) သို့မဟုတ်(၄၃တောင်)၊ (၂)မိုက်နှင့်(၂)လက်မရှိပါသည်။ စေတီတော်ကြီး လုံးပတ်မှာ ရှစ်မြှောင့်ပုံသဏ္ဍာန်ဖြစ်သည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'သကျမဟာမြတ်မုနိဘုရားကြီး',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'နတ်တလင်းခရိုင်',
        'township_name' => 'နတ်တလင်းမြို့နယ်',
        'photo' => 'images/သကျမဟာမြတ်မုနိဘုရား.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d13489.32711809842!2d95.54206059221912!3d18.424031873981335!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c717be58c3a551%3A0x62e5d4ff37b9d5f!2sThakya%20Mah%C3%A1%20Myat%20Muni%20Buddha%20Image!5e0!3m2!1sen!2smm!4v1718794433688!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'ပဲခူးတိုင်းဒေသကြီး၊ နတ်တလင်းခရိုင်၊ နတ်တလင်းမြို့။',
        'history' => '(ရည်ညွှန်းစာ : သကျမဟာမြတ်မုနိဘုရားကြီး၏ ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်းဖြစ်ပါသည်။)\r\n\r\nသဗ္ဗာညုမြတ်စွညဘုရား ပရိနိဗ္ဗာန်စံတော်မူပြီးနောက် ပေါက္ကံပြည် စောရဟန်းမင်း ဖြိုခွင်းသက္ကရာဇ် (၁၂၅၉) ခုနှစ်သို့ ရောက်တော်မူသောအခါ ရာမညတိုင်း၊ သမိုင်းတွင်ရာ၊ သာယာဝတီနယ်သီး၊ ပြည်မီးရထား လမ်း၊ ထူးဆန်းလှစွာ၊ နတ်ရွာခပင်း၊ နတ်တလင်းမြို့သစ်၌ နေရင်းရှိသော လဲတော်တိုက်သူကြီးမင်း ဦးရွှေ ဗျော့သည် ဥက္ကဌလုပ်ပြီး နောက်လိုက်စာရင်းပါများစွာသော ဘုရားဒါယကာ ဥပသကာတို့နှင့်အတူ တိုက်နယ် အတွင်းရှိ သဒ္ဓါရှိသူတို့ လှူဒါန်းထောက်ပံ့ကူညီမှုဖြင့် မန္တလေးမြို့ရှိ မဟာမြတ်မုနိဘုရားကြီးနှင့် သဏ္ဍာန် တော်တူ ဗုဒ္ဓရုပ်ပွားတော်မြတ်ကြီး တည်ထားကိုးကွယ်ရန်အတွက် ဒုတိယရွှေကျင်သာသနာပိုင် ဆရာတော် ကြီး၏ တပည့်ရတနာပုံ မန္တလေးကျောင်းတိုက်တွင် သီတင်းသုံးတော်မူသော ဆရာတော်ဦးသုတ၏ စီစဉ် လမ်းညွှန် ဩဝါဒနှင့်အတူ မန္တလေးမြို့မှ ဗိသုကာပညာရှင်များကို ခေါ်ယူ၍ ရတနာပုံမန္တလေးကျောင်းတိုက်၏ မြောက်ဘက် ဒက္ခိဏာဒီပမြတ်ရာဌာန၌ ပန်းတဉ်းဆရာတို့သည် စက်ရဟတ်များစွာတို့ကို အသုံးပြုလျှက် များစွာသော မိုက်ခွက်တို့ဖြင့် ရွှေ၊ငွေ၊သလဲဖြူ၊သလဲမည်း၊ သလဲစင်၊ ကြေးရည်တို့ဖြင့် မြန်မာသက္ကရာဇ် (၁၂၅၉) ခုနှစ်၊ တန်ခူးလမှစတင် သွန်းလောင်းပူဇော်ကြရာ နယုန်လဆန်း (၁၃)ရက်၊ အင်္ဂါနေ့တွင် အပြီးတိုင် သွန်းလောင်းအောင်မြင်တော်မူခဲ့ပြီး ကြေးအချိန်(၄၁၀၀) လေးထောင်တရာ ဉာဏ်တော်အမြင့် (၇)တောင် (၂)မိုက်ရှိတော်မူသော သကျမဟာမြတ်မုနိမည်ရှိခေါ်တွင် ဗုဒ္ဓရုပ်ပွားဆင်းတုတော် မြတ်ကြီးအား တည်ထား ကိုးကွယ်ရန်တော်မူခဲ့ပါသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'သာရမဥ္ဇူသာမိုးကောင်းစေတီတော်',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'နတ်တလင်းခရိုင်',
        'township_name' => 'သဲကုန်းမြို့နယ်',
        'photo' => 'images/သာရမဥ္ဖူသာမိုးကောင်းစေတီတော်.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3773.9183573669948!2d96.4391466742647!3d18.935007556385436!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c5d9f46ee5165f%3A0x144f153ad5c5934c!2z4YCe4YCs4YCb4YCZ4YCJ4YC54YCF4YCw4YCF4YCx4YCQ4YCu4YCQ4YCx4YCs4YC6!5e0!3m2!1sen!2smm!4v1718797308831!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'နတ်တလင်းခရိုင်၊ သဲကုန်းမြို့။',
        'history' => '(ရည်ညွှန်းစာ။ သာရမဥ္ဇူသာမိုးကောင်းစေတီတော်မြတ်ကြီး၏  ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်းဖြစ်ပါသည်။)\r\n\r\n သဲကုန်းမြို့ဟောင်းဒေသသည် ဗုဒ္ဓသာသနာအစောဆုံးရောက်ရှိပြီး စာပေယဉ်ကျေးမှုအဆင့်အတန်း လည်း မြင့်မားနေကြောင်းလည်း သိရပါသည်။ သာရမဉ္ဇူသာမိုးကောင်းစေတီသည်လည်း ရှေးဟောင်းစေတီ တစ်ဆူဖြစ်ပါသည်။ ရှေးအစဉ်အဆက်သမိုင်းကြောင်းအရ ပျုခေတ်ကစေတီ(၃)ဆူတည်ထားခဲ့ရာ ကျောင်း ကုန်းရွာထိပ်စေတီကိုမဉ္ဇူဟုခေါ်ပြီး ထန်းရင်းရွာရှိစေတီငယ်ကို သာရဟုခေါ်ကာ မိုးကောင်းကျောင်း တိုက် နားရှိ စေတီကို မိုးကောင်းစေတီဟု ခေါ်ဆိုကြောင်းသိရပါသည်။ မိုးကောင်းစေတီကို နှစ်ကာလ ကြာအောင်ပင် ပြုပြင်မွမ်းမံသူမရှိဘဲ ချုံနွယ်ပိတ်ပေါင်းတို့ကြားတွင် ရှိနေသောစေတီပျက်ငယ်ကို လူအမည်ဦးရွေလုံး(ခေါ်) ဘုန်းကြီးတစ်ပါဦးဆောင်ကာ ဒါယကာ/ဒါယိကာမများ အင်အားဖြင့် ဉာဏ်တော် အတောင်(၂၀)ထိအောင် ပြုပြင်တည်ထားကိုးကွယ်ခဲ့ပါသည်။\r\n၁၂၄၈-ခုနှစ်တွင် သဲကုန်းမြို့ကို မြန်မာသက္ကရာဇ် ၁၂၃၉-ခု၊ ခရစ်သက္ကရာဇ် ၁၈၇၉-ခု မြို့သစ်စတည် ထောင်ခဲ့ပြီး မြို့ပိုင် ဦးကြည် အုပ်ချုပ်ခဲ့ပါသည်။ မြို့ပိုင်ဦးကြည်ဦးဆောင်ကာ အများပြည်သူတို့စုပေါင်း ကောင်းမှုဖြင့် ဉာဏ်တော်အမြင့်(၅၈)တောင်  (၄)သစ်လုံးပတ်တော်(၃၈)တောင်(၈)သစ်အောက်ခြေပတ်လည် (၁၀၆)တောင် (၅)မိုက်ရှိသောစေတီကြီး ပြုပြုင်မွမ်းမံကာ ကုန်းတော်ရင်ပြင်တော်ကိုလည်း ချဲ့ထွင် ဆောင်ရွက်ခဲ့ပါသည်။ သာရမဉ္ဇူသာမိုးကောင်းစေတီတော်ဟု ခေါ်တွင်ခဲ့ပါသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'သမိုင်းဝင်မြသိန်းတန်စေတီတော်',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'နတ်တလင်းခရိုင်',
        'township_name' => 'ဇီးကုန်းမြို့',
        'photo' => 'images/သမိုင်းဝင်မြသိန်းတန်စေတီတော်.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d484756.8228857164!2d95.31568368740552!3d18.339861358222656!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c722746ec431cd%3A0x8ce93df7480b1f56!2sMya%20Thein%20Tan%20Pagoda!5e0!3m2!1sen!2smm!4v1718796116606!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'နတ်တလင်းခရိုင်၊ ဇီးကုန်းမြို့။',
        'history' => '(ရည်ညွှန်းစာ : သမိုင်းဝင်မြသိန်းတန်စေတီတော်မြတ်ကြီး၏ ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်းဖြစ်ပါသည်။)\r\n\r\nနရသီဟပတေ့မင်းလက်ထက် ပုဂံနေပြည်တော်ကြီး ပျက်သုဉ်းပြီးနောက် မင်းညီမင်းသားများစွာ အောက်ပြည်အောက်ရွာသို့ ခုန်ဆင်းလာခဲ့သည်။ ထိုမင်းဆွေမင်းမျိုးများအနက်မှ နရသီဟပတေ့မင်း၏                       တူတော်စပ်သူမောင်မောင်ကြီး(ခေါ်) သတိုးနော်ရထားမင်းသည် သက္ကရာဇ်(၆၄၉) ခုနှစ်တွင် သာယာဝတီမင်း နေပြည်တော်ကို တည်ထောင်ခဲ့ပါသည်။ သာယာဝတီ တောင်ညိုနှင့် ကျောက်စောင်းသုံးမြို့ကိုအပိုင်းစား ရသောကြောင့် သုံးမြို့ရှင်ဟုလည်း ခေါ်ဝေါ်ကြပါသည်။ထိုစဉ်က သာယာဝတီနေပြည်တော်မှာ ယခုကြို့ပင် ကောက်မြို့ အရှေ့ဘက်မြို့တွင်း ရွာအနီး သာယာဝတီနေပြည်တော် အကျယ်အဝန်းမှာ ပေါင်းတည်မြို့နယ် နှင့်မင်းလှမြို့နယ်အကြားထိ လည်းကောင်း၊ အရှေ့ဘက်ပဲခူးရိုးမမှ အနောက်ဖက် ဧရာဝတီမြစ်အထိ ကျယ် ဝန်းပါသည်။\r\n သတိုးနော်ရထားမင်းသည် တိုင်းခန်းလှည့်လည်ခဲ့ရာ သက္ကရာဇ်(၆၇၄)ခုနှစ်တွင် ဇီးကုန်မြို့အနီး သာယာသောကုန်းမြေတစ်ခုသို့ ရောက်ရှိခဲ့ရာ စေတီတစ်ဆူတည်ထားလိုသော ဆန္ဒဖြစ်ပေါ်လာခဲ့သဖြင့် မူးကြီးမတ်ရာများနှင့် တိုင်ပင်ပြီး မြသိန်းတန်စေတီတော်ကို တည်ထားတော်မူပါသည်။စေတီဌာပနာရာတွင် အဖိုးတစ်သိန်းထိုက်သော မြထဘက်ကိုလည်းကောင်း၊အဖိုးတစ်သိန်းထိုက်သော မြသားစစ်စင် ဘုရားဆင်း တုတော်တစ်ဆူကို ထုလုပ်လှူဒါန်းခဲ့ကြသောကြောင့် ၎င်းမြသားရတနာများစွာတို့ ပါဝင်သောကြောင့်လည်း ကောင်းမြသိန်းတန်စေတီတော် ဟူ၍သမုတ်တော်မူခဲ့ကြပါသည်။ မြသိန်းတန်စေတီတော်ကို သတိုးနော်ရထာ မင်းစတင်ကိုးကွယ်စဉ်က အမှတ်(၄)ရပ်ကွက်၊ ဘုရားလမ်းသံမ္မောရုံတည်ရှိရာ နေရာဖြစ်ပါသည်။ အင်္ဂလိပ် အစိုးရလက်ထပ် ၁၈၉၂-ခုနှစ်၊မြန်မာသက္ကရာဇ် ၁၂၅၄-ခုနှစ်တွင် မူလနေရာမှမြိူ့၏ မြောက်ဖက်သို့ နယ်ချဲ့ အင်္ဂလိပ်အာဏာပိုင်တို့၏ အမိန့်အရ မဖြစ်မနေပြောင်းရွှေ့ပေးခဲ့ရပါသည်။\r\n မူလကျန်ရှိခဲ့သော သတိုးနော်ရထားမင်း တည်ထားခဲ့သောနေရာတွင် စေတီတစ်ဆူထပ်မံတည်ထား ခဲ့ကြပြီး ယခုအခါ မူလရာမမြသိန်းရံစွယ်တော်မြတ်စေတီတော်ဟူ၍ ခေါ်ဝေါ်သမုတ်လျှက် ဆက်လက်တည် ထားကိုးကွယ်ခဲ့ကြပါသည်။မြောက်ဖက်သို့ ပြောင်းရွှေ့တည်ထားသော စေတီတော်ကြီးမှာ (၈)နှစ်အကြာ ၁၂၆၂-ခုနှစ်တွင် အားလုံးပြီးစီးအောင်မြင်ခဲ့ပါသည်။မူလတည်ထားသောစေတီတော်မှာ ဉာဏ်တော်အမြင့်     အဆောင်(၃၀)ရှိပြီး သာသနာပိုင်ဆရာတော်ကြီး၏ ဉာဏ်တော်(၆၅)တောင် (၁၃) လက်မဖြစ်လာခဲ့ရာ သမိုင်း ဝင်မြသိန်းတန် စေတီတော်ကြီးမှာ ပိုမိုကြည်ညိုသပ္ပါယ်ဖွယ်ရာ ဖြစ်လာခဲ့ပါသည်။\r\nစေတီတော်ကြီး၏ ရင်ပြင်တော်အကျယ်မှာ (၁၈၀’)x(၁၈၀’)ဖြစ်၍ဉာဏ်တော်အမြင့် ၁၂၈’-၇” စေတီ ရံပေါင်း(၃၂)ဆူနှင့် ကျောက်ဆင်းတုရုပ်ပွားတော်အဆူ(၃၀)၊ ရှင်ဉပဂုတ္တရဟန္တာတစ်ဆူတို့ ကိန်းဝပ်စံပ္ပါယ် လျှက်ရှိပါသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'ရတနာသီရိမဟာဘုရားကြီးစေတီတော်မြတ်ကြီး',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပြည်ခရိုင်',
        'township_name' => 'ပြည်မြို့နယ်',
        'photo' => 'images/ဘုရားကြီး.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d15105.582042415363!2d95.2582528!3d18.825074!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c79c832dbd2ec3%3A0x12714521323ede56!2sPhaya%20Gyi%20Stupa!5e0!3m2!1sen!2smm!4v1718859317585!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'ပြည်-အောင်လံလမ်းမကြီးဘေး၊ ဘုရားကြီးရပ်ကွက်၊ ပြည်မြို့။',
        'history' => '(ရည်ညွှန်းစာ  :   ရတနာသီရိမဟာဘုရားကြီးစေတီတော် ဂေါပကအဖွဲ့မှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားခြင်း ဖြစ်ပါသည်။)                \r\n   \r\n\r\n           ရတနာသီရိမဟာဘုရားကြီး စေတီတော်မြတ်ကြီးသည် သရေခေတ္တရာမြို့ဟောင်း၏ အနောက်မြောက်ဘက် ပြည်အောင်လံ ကားလမ်းမဘေးတွင် တည်ရှိပါသည်။ အစဉ်အလာပြောဆိုမှု များနှင့် မြန်မာရာဇဝင်ကျမ်းအချို့တွင် ဒွတ္တဘောင်မင်း တည်ထားခဲ့သော စေတီကိုးဆူအနက် တစ်ဆူအပါအဝင် ဖြစ်ပါသည်။ မြတ်စွာဘုရားရှင်၏ ဓာတ်တော်စစ်တစ်ဆူ လက်ယာခြေမတော်မှ ခြေသည်းတော်ကို ထည့်သွင်းဌာပနာထားကာ မဟာစေတီဟု သမုတ်၍ တည်ထားခဲ့ကြောင်း စေတီတည်ထားစဉ်က ဖြေးဖြေးဆေးဆေး တည်တော်မူပါသဖြင့် ဆေးဆေးစေတီဟု လည်းကောင်း၊ အလွန်ကြီးမားသောကြောင့် မဟာစေတီဟုလည်းကောင်း ယခုအချိန်အခါတွင် ရတနာသီရိမဟာ ဘုရားကြီးစေတီတော်မြတ်ကြီးဟု ခေါ်ဆိုသည်။\r\nရတနာသီရိမဟာဘုရားကြီး စေတီတော်မြတ်ကြီး စေတီ၏ ပုံသဏ္ဌာန်သည် အခြေ၌ ပြောင်းရှည်ပုံသဏ္ဌာန်ရှိပြီး အပေါ်သို့ ကန်တော့ပုံ တဖြည်းဖြည်းခုံးသွားသော ပုံသဏ္ဌာန်ဖြစ်သည်။ ၎င်းစေတီသည် မူလက်ရာဖြစ်ပြီး အုတ်နှင့်ထုံးသရွတ်များ စေတီ၏မျက်နှာပြင် တွင် ကျန်ရှိနေသေးကြောင်း တွေ့ရှိရပါသည်။ ပစ္စယာ(၄)ဆင့် ပါရှိပြီး ထောင့်(၁၆)ထောင့်ပါသော ပစ္စယာ(၃)ဆင့်နှင့် ထိပ်ဆုံးပစ္စယာမှာ အဝိုင်းပုံသဏ္ဌာန် ရှိသည်။ ဘုရားကြီးစေတီ၏အမြင့်မှာ (၁၃၉)ပေရှိပြီး လုံးပတ်မှာ (၃၀၇)ပေရှိသည်။ ဘုရားကြီးစေတီသည် မြန်မာနိုင်ငံအတွင်း စေတီ တည်ထားကိုးကွယ်မှုအပိုင်းတွင် အစောဆုံးထဲ၌ အပါအဝင်ဖြစ်ပြီး ပျူခေတ်အလယ်ပိုင်း (အေဒီ  ၄ - ၇ ရာစု)တွင် တည်ထားခဲ့သော စေတီတစ်ဆူ ဖြစ်ပါသည်။ ၎င်းသည် မျက်မှောက်ခေတ်စေတီများ၏ ရှေ့ပြေးပုံစံ အသွင်မျိုးဖြစ်သည်။ ဘုရားကြီးစေတီသည် ပျူလူမျိုးတို့၏ ယုံကြည်ကိုးကွယ်မှု အယူဝါဒများထဲမှ ဗုဒ္ဓဘာသာရေးနှင့် ဆက်စပ်နေသော အဆောက်အအုံဖြစ်သောကြောင့် ကမ္ဘာ့အမွေအနှစ်စံညွှန်းအဖြစ် သတ်မှတ်ခဲ့ခြင်းဖြစ်ပါသည်။ (၁၉၁၁-၁၉၁၂)နှင့် (၁၉၁၂-၁၉၁၃)ခုနှစ် တွင် ဘုရားကြီးစေတီ၏ တောင်ဘက်အနီးတွင် ကျောက်အရိုးအိုးလေးလုံးနှင့် မြေအရိုးအိုးတစ်လုံး တူးဖော်ရရှိခဲ့ပါသည်။ ထိုအရိုးအိုးများပေါ်၌ ပျူစာများ ရေးထိုးထားပြီး ထိုစာများအရ ၎င်းအရိုးအိုး များသည် သရေခေတ္တရာတွင် စိုးစံခဲ့သော ဟရိစိတြမင်း၊ သီဟဝိကြမမင်း၊ သူရိယဝိကြမမင်းတို့၏ အရိုးအိုးများဖြစ်ကြောင်း သိရှိခဲ့ရသည်။',
        'status' => 'famous'
    ],
    [
        'name' => 'ဘုရားမာစေတီ',
        'division_name' => 'ပဲခူးတိုင်းဒေသကြီး',
        'district_name' => 'ပြည်ခရိုင်',
        'township_name' => 'ပြည်မြို့နယ်',
        'photo' => 'images/ဘုရားမာ.jpg',
        'map_link' => '<iframe src=\"https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d3776.184539738246!2d95.29942607593966!3d18.834460759509422!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x30c79bfa313fffff%3A0xd8a02e70817f2179!2sPhaya%20Mar%20Pagoda!5e0!3m2!1sen!2smm!4v1718178987555!5m2!1sen!2smm\" width=\"600\" height=\"450\" style=\"border:0;\" allowfullscreen=\"\" loading=\"lazy\" referrerpolicy=\"no-referrer-when-downgrade\"></iframe>',
        'website' => '',
        'address' => 'ပြည်-ပေါက်ခေါင်း လမ်းမကြီးဘေး ၊ ပြည်မြို့။',
        'history' => '(ရည်ညွှန်းစာ : ရှေးဟောင်းသုတေသနနှင့် အမျိုးသားပြတိုက်ဦးစီးဌာနမှ ပေးပို့ထားသော မှတ်တမ်းမှ ကူးယူဖော်ပြထားပါသည်။)\r\n\r\n          ဘုရားမာစေတီကို သရေခေတ္တရာမြို့ဟောင်း၏ အရှေ့မြောက်ဘက် ပြည်-ပေါက်ခေါင်း ကားလမ်းနံဘေး၊ ကုန်းရိုးကျေးရွာအနီးတွင် တည်ရှိပါသည်။ အစဉ်အလာ ပြောဆိုမှုများနှင့် မြန်မာရာဇဝင်ကျမ်းအချို့တွင် စေတီတော်၌ ဘုရားရှင်၏ဓာတ်တော်နှင့် လက်သည်းတော်၊ ခြေသည်းတော်၊ ညှပ်ရိုးတော်တို့ကို ဌာပနာထား၍ တည်ထား ကိုးကွယ်ခဲ့သော စေတီတစ်ဆူဖြစ်ကြောင်း သိရှိရပါသည်။ ရှေးယခင်က “သရိုင်မာ” စေတီဟု ခေါ်ဝေါ်ခဲ့ကြပြီး အေဒီ(၆-၇)ရာစုတွင် ဒွတ္တဘောင်မင်းကြီးမှ တည်ထားခဲ့သော ဉာဏ်တော် အမြင့် (၁၃၈)ပေရှိသည့် စေတီတစ်ဆူဖြစ်ပါသည်။ ဘုရားမာစေတီကြီး၏ ဗိသုကာပုံစံမှာ ကြီးမားမတ်စောက်သော ခေါင်းလောင်းပုံစံရှိပြီး ထိပ်ပိုင်းတွင် ခရေသီးပါရှိ၍ ထီးတော်တင် ထားသည်။ ပစ္စယာလေးဆင့်ပါရှိပြီး ထောင့်(၁۶)မြှောင့်ပါသော ပစ္စယာ(၃)ဆင့်နှင့် စတုတ္ထ ပစ္စယာမှာ အဝိုင်းပုံစံဖြစ်ပါသည်။ ဘုရားမာစေတီတော်ကြီးကို အုတ်ဖြင့်ဂင်းပိတ်ပုံစံ အဆင်တန်ဆာမရှိဘဲ ရိုးရိုးရှင်းရှင်း တည်ဆောက်ထားပါသည်။',
        'status' => 'famous'
    ],


    







    
];
}

    // Logic ကို ခွဲထုတ်ထားတဲ့အတွက် Run ရတာ ပိုရှင်းသွားပါတယ်
    private function seedPagoda(array $data): void
    {
        $district = District::where('name', 'LIKE', '%' . $data['district_name'] . '%')->first();
        if (!$district) return;

        $township = Township::where('name', 'LIKE', '%' . $data['township_name'] . '%')
                            ->where('district_id', $district->id)
                            ->first();

        if ($township) {
            Pagoda::updateOrCreate(
                ['name' => $data['name']],
                [
                    'township_id' => $township->id,
                    'photo'       => $data['photo'],
                    'map_link'    => $data['map_link'],
                    'website'     => $data['website'],
                    'address'     => $data['address'],
                    'history'     => $data['history'],
                    'status'      => $data['status']
                ]
            );
        }
    }
}